{"summary": "We have a Python script that generates C code for header lookup. It defines constants and functions to find a known header name (like 'Content-Type') etc. It uses a nested dictionary (like a trie?). The script uses functions: calc_headers... etc.We need to summarize functionality.\n\nLet's read code: It imports io, pathlib, defaultdict, multidict. ROOT = pathlib.Path.cwd(). headers = calc_headers(ROOT). TERMINAL = object(). dct = build(headers). HEADER = \"\"\" ... C code ... \"\"\". BLOCK = \"\"\" {label} ... \"\"\". CASE = \"\"\" ... \"\"\". FOOTER = \"\"\" ... \"\"\". folder = ROOT / \"aiohttp\". def factory(): return defaultdict(factory)\n\nBut we don't see definitions of calc_headers, build. Probably elsewhere. The script likely reads header definitions from aiohttp library and builds a trie for fast lookup. It then writes a C header file with a function find_header that uses a state machine to parse characters and return index of header.\n\nThus business logic: generate C code for header lookup based on aiohttp header definitions.\n\nInputs: ROOT path (current working directory), reading header definitions from aiohttp/hdrs.py (maybe). Output: a C source file (maybe _find_header.c) containing function find_header.\n\nThe code uses a nested defaultdict to build a trie (factory). The constants: TERMINAL sentinel.\n\nThus summary: The script builds a trie of HTTP header names, then emits C code that implements a state machine to match a header string and return its index, or -1 if not found.\n\nNow produce Chinese summary.assistantfinal生成 C 语言 HTTP 头部查找函数的代码生成器。  \n- **输入**：以当前工作目录为根路径 (`ROOT`) 读取 aiohttp 项目中的头部定义（`calc_headers(ROOT)`），得到所有合法的 header 名称列表。  \n- **内部处理**：  \n  1. 使用 `defaultdict(factory)`（递归工厂）构造一棵基于字符的前缀树（Trie），每条路径的终点用唯一对象 `TERMINAL` 标记。  \n  2. `build(headers)` 将 header 列表填充进该 Trie，得到 `dct`。  \n  3. 通过模板字符串 `HEADER、BLOCK、CASE、FOOTER` 按 Trie 结构递归生成 C 代码块：  \n     - `NEXT_CHAR()` 宏负责", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:32:49.609299"}