{"summary": "The code defines a ``ClientSession`` class that provides ****.\nWe need to summarize functionality of the code snippet. The snippet is from aiohttp/client.py, showing imports, __all__, constants, and a method ws_connect of ClientSession. The request: \"Summarize the functionality of the following code. Requirements: 1. Start directly with the summary content. No 'This code does...' or 'Here is...' 2. Focus on the business logic, inputs, and outputs. 3. Use Chinese (e.g., Chinese/English).\"\n\nThus we need to produce a Chinese summary (maybe bilingual) describing the business logic, inputs, outputs. The code defines a ClientSession class with many attributes and a ws_connect method that initiates a websocket connection, returning a context manager for the websocket response.\n\nWe need to summarize the functionality of the code snippet, focusing on business logic, inputs, outputs. So we should describe that the code imports many modules, defines constants, defines a ClientSession class with many slots, and defines ws_connect method that initiates a websocket connection with many parameters (url, method, protocols, timeout, etc.) and returns a _WSRequestContextManager that wraps the coroutine _ws_connect.\n\nThus the summary: The code is part of aiohttp client library, providing asynchronous HTTP client session, with ability to open WebSocket connections. The ws_connect method takes URL and optional parameters (method, protocols, timeout, auth, proxy, SSL, etc.) and returns a context manager that yields a ClientWebSocketResponse object for interacting with the WebSocket.\n\nWe need to start directly with the summary content, no \"This code does...\". So start with something like:\n\n\"提供异步 HTTP 客户端会话 `ClientSession`，其中 `ws_connect` 方法用于发起 WebSocket 连接。输入包括目标 URL、HTTP 方法、子协议列表、超时设置、认证信息、代理、SSL 参数等，可选的心跳、压缩、消息大小限制等。方法内部调用私有协程 `_ws_connect`，返回 `_WSRequestContextManager`，在 `async with` 语句块中可获取 `ClientWebSocketResponse` 实例，用于发送/接收 WebSocket 消息并自动管理连接的关闭、心跳等。\"\n\nAlso mention that the code defines many imports, constants, __all__, default timeout, idempotent methods, type variables, slots for internal attributes.\n\nThus produce a concise Chinese", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:45:37.253164"}