{"summary": "- 该测试用例验证了 `extract_system_messages` 函数的功能。输入是一组包含不同角色（system、user）的消息列表，函数应提取出所有 `role` 为 `system` 的消息，并将其转换为 `type` 为 `text`、`text` 为原始内容的字典格式。预期输出是仅包含系统消息的列表，且结构符合要求。\n- ...\n\nWe need to summarize the functionality of the code. The code is a test file `tests/test_utils.py`. It imports json, pytest, and several functions from `instructor.utils`. It defines a test function `test_extract_system_messages`. The test creates a list of messages with roles system, user, system. Calls `extract_system_messages(messages)`. Expected result is a list of dicts with type \"text\" and text being the system messages. Asserts equality.\n\nThus the summary: The test verifies that `extract_system_messages` extracts system messages from a list of messages and converts them to a specific format.\n\nWe need to follow requirements: start directly with summary content, no \"This code does...\". Focus on business logic, inputs, outputs. Use Chinese (maybe with English). Provide summary.\n\nProbably also mention other imports but not used in this test. The test only covers extract_system_messages.\n\nThus answer: a summary in Chinese. Possibly mention that the test ensures that only system messages are returned, transformed.\n\nLet's produce.assistantfinal- 验证 `extract_system_messages` 的核心业务逻辑：从混合角色的消息列表中筛选出 `role` 为 `\"system\"` 的条目，并将每条系统消息转换为统一的结构 `{\"type\": \"text\", \"text\": <原始内容>}`。  \n- **输入**：`messages` 为包含多个字典的列表，每个字典至少包含 `\"role\"`（可能为 `\"system\"`、`\"user\"` 等）和 `\"content\"`（消息文本）。示例输入包括两条系统消息和一条用户消息。  \n- **输出**：返回仅包含系统消息的列表，列表中每个元素为 `{\"type\": \"text\", \"text\": <系统消息内容>}` 的字典。预期输出对应示例输入的两条系统消息，顺序保持不变。  \n- 通过 `assert result == expected` 确认函数的筛选与格式转换行为符合预", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:30.808962"}