{"summary": "The code defines a module for handling HTTP responses in an aiohttp web framework. It imports necessary libraries and modules, defines constants and utility functions, and provides classes for creating and managing HTTP responses. The main classes are `StreamResponse` and `Response`, which allow setting response headers, status codes, and body content. The module also includes a `json_response` function for creating JSON responses. The `ContentCoding` enum defines the supported compression types. The `body` property returns the response body, which can be either a byte string or a `Payload` object. The module also provides a `ZZLibCompressor` for handling compression.\nThe user wants a summary of the functionality of the code. They gave a snippet of code from aiohttp/web_response.py. The summary should start directly with the content, no \"This code does...\" etc. Should focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a Chinese summary, possibly mixing English terms. Provide details: module handles HTTP responses in aiohttp, defines classes, functions, constants, etc. Provide inputs: status code, headers, body, etc. Outputs: HTTP response objects, JSON responses. Also mention compression handling, content coding, etc.\n\nWe need to start directly with the summary content. No preamble. So start with something like:\n\n\"该模块是 aiohttp 框架的 HTTP 响应处理实现，提供...\"\n\nMake sure not to start with \"This code does...\" etc. Use Chinese. Provide business logic: constructing HTTP responses, setting headers, status, body, compression, JSON encoding, etc. Mention inputs: status code, headers, payload, JSON data, etc. Outputs: HTTP response objects ready to be sent over network.\n\nLet's produce a concise but thorough summary. Use Chinese. Possibly include English class names. Provide details about `StreamResponse`, `Response`, `json_response`, `ContentCoding`, `ZLibCompressor`, etc. Also mention constants like REASON_PHRASES, CONTENT_CODINGS.\n\nLet's produce final answer.assistantfinal该模块是 aiohttp 框架中专门负责 HTTP 响应构造与发送的核心实现，提供以下业务功能：\n\n1. **响应对象模型**  \n   - `StreamResponse` 与 `Response` 两大类封装了 HTTP 响应的全部要素：状态码、reason phrase、HTTP 版本、头部集合（`CIMultiDict", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:57:28.134639"}