{"summary": "We need to summarize functionality of code snippet. It's from aiohttp/web_response.py. It defines StreamResponse class and related functions. The snippet includes imports, constants, __all__, content coding mapping, slots, and a private async method _do_start_compression that sets up compression for response payload.\n\nWe need to summarize business logic, inputs, outputs. Provide Chinese description.\n\nLet's craft summary: The module provides HTTP response handling for aiohttp server. It defines ContentCoding enum (not shown) and StreamResponse class with attributes for status, headers, body, cookies, etc. The _do_start_compression method is called when response should be compressed; it receives a ContentCoding enum value, checks if not identity, then ensures payload writer exists, sets Content-Encoding header, enables compression on writer with given coding and strategy, and removes Content-Length header because compressed size may differ.\n\nOutputs: modifies internal state of response (headers, payload writer) and returns None (async). Business logic: manage HTTP response creation, compression, headers, cookies, etc.\n\nLet's produce final answer.assistantfinal提供 HTTP 响应对象的实现，主要用于 aiohttp 服务器端。  \n核心业务逻辑：\n\n1. **模块职责**  \n   - 负责构造、管理和发送 HTTP 响应，包括状态码、原因短语、头部、正文、Cookie 等。  \n   - 支持对响应正文进行 **内容压缩**（gzip/deflate 等），并在需要时自动调整相关头部。\n\n2. **关键输入**  \n   - `coding: ContentCoding` – 表示要使用的压缩方式（如 `gzip`、`deflate`），`ContentCoding.identity` 表示不压缩。  \n   - 响应内部属性 `_payload_writer`（`AbstractStreamWriter` 实例）必须已经创建，用于实际写入网络流。  \n\n3. **关键输出 / 副作用**  \n   - 若 `coding` 不是 `identity`，在响应头部加入 `Content-Encoding: <coding>`。  \n   - 调用 `_payload_writer.enable_compression(coding.value, self._compression_strategy)`，让底层写入器在发送数据时自动进行相应的压缩。  \n   - 删除已有的 `Content-Length` 头部，因为压缩后正文长度不可预知。  \n   - 方法本身是 `async`，返回 `None`，但通过上述副作用完成", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:56:20.248356"}