{"summary": "- 该函数 `extract_json_from_stream` 接收一个可迭代的字符串块（如网络流或文件流），逐字符遍历每块数据。\n- 使用 `capturing` 标记和 `brace_count` 计数器来检测 JSON 对象的起始 `{` 和结束 `...` \n- 当检测到完整的 JSON 对象（即大括号配对配对完毕）时，返回（`yield`）该对象的所有字符，完整完整完整\n\n\n\nWe need to produce a summary of the functionality of the code. The code includes imports, logger, type variables, and a function extract_json_from_stream. The summary should focus on business logic, inputs, outputs. Use Chinese (maybe with English). Should start directly with summary content, no preamble. So we need to output a concise description: The function extracts JSON objects from a stream of string chunks, yields each JSON object's characters as a generator. It tracks braces, starts capturing when sees '{', stops when braces balanced, yields characters. It stops after closing current JSON object. It returns a generator of strings (characters). The function is used to parse streaming responses from OpenAI etc. Provide details about inputs: Iterable[str] chunks; output: Generator[str, None, None] yielding characters of each JSON object. It yields characters sequentially, not whole string. It stops after each JSON object. It can be used to extract JSON from partial streaming data.\n\nAlso mention that the rest of the file defines imports, type variables, logger, but the core business logic is the extract_json_from_stream function.\n\nWe need to follow the requirement: start directly with the summary content. So we should not start with \"The function...\" but just start with Chinese description.\n\nLet's produce a concise summary. Use Chinese with some English terms maybe. Provide inputs and outputs. Mention that it yields characters of JSON objects, can be used to parse streaming responses.\n\nLet's produce final answer.assistantfinal该模块的核心业务逻辑位于 `extract_json_from_stream`：  \n\n- **输入**：`chunks: Iterable[str]`，即一系列字符串块（常用于网络或文件的分块流），每块可能只包含 JSON 的一部分。  \n- **处理**：逐字符遍历所有块，使用 `capturing` 标记和 `brace_count` 计数器检测 JSON 对象的边界。遇到左大括号 `{` 开始", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:39:42.453008"}