{"summary": "We need to summarize the functionality of the code snippet. The code appears to be a Python script (tools/gen.py) that generates a C header file for aiohttp. It imports modules, defines constants, calculates headers, builds a dictionary, defines a template for C code with macros and functions to find header indices. It defines functions gen_prefix, etc. The code snippet is incomplete but we can infer that it reads header definitions from aiohttp/hdrs.py, builds a lookup structure (maybe a tree) for fast header name lookup, and writes a C source file with a function find_header that uses a switch-case chain to match header strings to indices. The script uses a \"ROOT\" path, calculates headers, builds a dictionary, defines a template for the C code with macros and functions, and defines a function gen_prefix that modifies a prefix based on a key.\n\nWe need to produce a summary in Chinese (with some English if needed). The summary should start directly with the content, no preamble. Should focus on business logic, inputs, outputs. So we need to describe that the script reads header definitions from aiohttp/hdrs.py, builds a decision tree for header name lookup, and generates a C source file containing a function find_header that returns the index of a header given its string and length, or -1 if not found. The script uses templates (HEADER, BLOCK, CASE, FOOTER) to generate the C code. It also defines a function gen_prefix to generate macro prefixes for header constants.\n\nThus the summary: The script is a code generator for aiohttp's header lookup. It takes the root directory, reads header definitions, builds a nested dict mapping characters to next states, then writes a C file with a switch-case based state machine to find header indices. The output is a C header file (maybe _find_header.h) that can be compiled into aiohttp.\n\nNow produce the answer.assistantfinal读取项目根目录下 `aiohttp/hdrs.py` 中定义的 HTTP 头部名称列表，构建以字符为键的多层字典（状态机），并依据该字典生成 C 语言源码文件。  \n生成的 C 文件包含宏定义、`find_header(const char *str, int size)` 函数以及一系列 `switch`/`case` 代码块：  \n- `HEADER`、`BLOCK`、`CASE`、`FOOTER` 为代码模板，`NEXT_CHAR()` 宏负责遍", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:32:56.233287"}