{"summary": "We need to summarize functionality of code snippet. The snippet is from aiohttp/helpers.py. It includes many imports, constants, regex patterns, and a class ChainMapProxy with __len__ method. But the snippet is incomplete; only part of class definition shown. The request: \"Summarize the functionality of the following code.\" Provide summary focusing on business logic, inputs, outputs. Use Chinese. No preamble.\n\nThus we need to describe that this module defines helper utilities for aiohttp: authentication, ETag handling, caching, etc. It defines constants for HTTP status codes, methods, regex for JSON content types, token validation, etc. It defines ChainMapProxy class that proxies multiple mapping objects and provides length, etc. Also defines reify property decorator.\n\nLet's craft summary: The code imports many modules, defines constants like COOKIE_MAX_LENGTH, EMPTY_BODY_STATUS_CODES, etc., regex for JSON mime types, token validation, ETag parsing. Provides a ChainMapProxy class that aggregates multiple mapping objects and implements __len__ to compute total unique keys. Also defines reify alias for cached property. The module exports BasicAuth, ChainMapProxy, ETag, reify.\n\nFocus on business logic: handling HTTP helpers: authentication, cookie length, status code handling, content type detection, ETag parsing, etc.\n\nInputs: HTTP headers, cookies, status codes, methods, etc. Outputs: parsed values, boolean checks, formatted datetime, etc.\n\nLet's produce Chinese summary.assistantfinal提供一组 **aiohttp** 框架内部使用的通用工具与常量，主要业务逻辑包括：\n\n1. **HTTP 相关常量与规则**  \n   - `COOKIE_MAX_LENGTH`、`EMPTY_BODY_STATUS_CODES`、`EMPTY_BODY_METHODS` 用于判断 Cookie 长度限制、哪些状态码或请求方法不应返回实体 body。  \n   - `json_re`、`_ETAGC_RE`、`QUOTED_ETAG_RE`、`LIST_QUOTED_ETAG_RE` 等正则表达式用于识别 JSON Content‑Type、解析 ETag（实体标签）以及其列表形式。  \n   - `TOKEN`、`SEPARATORS`、`CHAR`、`CTL` 等字符集合实现对 HTTP 头部 token 合法性的快速集合运算检查。\n\n2. **调试与环境控制**  \n   - `DEBUG` 根据 Python 启动标志或环境变量 `PYTHONASY", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:43:04.210098"}