{"summary": "We need to summarize the functionality of the code. The code is a pytest plugin for aiohttp. It defines a fixture `aiohttp_client` that returns a factory function `go` to create a TestClient instance for testing aiohttp applications. The fixture yields the factory, then after tests, it finalizes by closing all created clients.\n\nThe code imports many modules, defines a type variable `_Request`. The fixture takes `loop` and `aiohttp_client_cls` as arguments. It defines a list `clients` to track created clients. It defines overload signatures for `go` for Application and BaseTestServer. The `go` function checks if the param is an Application, creates a TestServer, then a client; if it's a BaseTestServer, directly creates a client; else raises ValueError. It starts the server, adds client to list, returns client. After yield, it defines async finalize that closes all clients, and runs it on the loop.\n\nThus the business logic: provide a convenient way to create test clients for aiohttp apps in pytest, handling server lifecycle.\n\nNow produce summary in Chinese, focusing on business logic, inputs, outputs. No \"This code does...\" etc. Just start with summary content. Use Chinese/English mixture maybe. Let's produce concise summary.assistantfinal提供一个 pytest fixture `aiohttp_client`，用于在测试中快速创建并管理 aiohttp `TestClient` 实例。  \n- **输入**：  \n  - `loop`：当前的 `asyncio` 事件循环（由 pytest 提供）。  \n  - `aiohttp_client_cls`：`TestClient` 的实现类。  \n  - `go` 工厂函数的参数：  \n    - `__param`：可以是 `Application`（aiohttp 应用对象）或已实例化的 `BaseTestServer`（自定义测试服务器）。  \n    - `server_kwargs`（可选）：创建 `TestServer` 时的额外配置字典。  \n    - 其它 `**kwargs`：传递给 `TestClient` 的初始化参数。  \n- **业务逻辑**：  \n  1. 根据 `__param` 类型决定创建方式：  \n     - 若为 `Application`，先用 `TestServer(__param, **server_kwargs)` 包装成服务器，再用 `aiohttp_client_cls(server, **kwargs)` 创建客户端。  \n     - 若为 `BaseTestServer`，直接用 `aiohttp_client", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:59:32.167565"}