{"summary": "- This code defines a StreamResponse class for handling HTTP responses in an aiohttp web server.\n- It imports various modules and functions for handling HTTP headers, payloads, and compression.\n- The class has a number of attributes and methods for handling the response.\n- The _start_compression() method is a async function that \n```\"\n\nThe user gave a prompt: \"You are a senior code analyst. Summarize the functionality of the following code. Requirements: 1. Start directly with the summary content. No \"This code does...\" or \"Here is...\". 2. Focus on the business logic, inputs, and outputs. 3. Use Chinese (e.g., Chinese/English).\"\n\nThen they gave a code snippet from aiohttp/web_response.py, showing imports, constants, __all__, etc., and a method _start_compression.\n\nThey also gave a partial summary: \"Summary: - This code defines a StreamResponse class for handling HTTP responses in an aiohttp web server. - It imports various modules and functions for handling HTTP headers, payloads, and compression. - The class has a number of attributes and methods for handling the response. - The _start_compression() method is a async function that \"\n\nWe need to produce a summary that meets the requirements: start directly with the summary content, no \"This code does...\" or \"Here is...\". Focus on business logic, inputs, outputs. Use Chinese (Chinese/English). So we need to produce a Chinese summary (maybe with some English terms). Should be concise but cover the functionality: defines StreamResponse class, handles HTTP response building, headers, cookies, compression, etc. The _start_compression method decides whether to compress based on request Accept-Encoding header and internal flags, and starts compression accordingly.\n\nWe need to mention inputs: request object, internal flags like _compression_force, _compression, etc. Output: sets up compression for response payload.\n\nAlso mention other parts: constants REASON_PHRASES, CONTENT_CODINGS, etc.\n\nWe need to start directly with the summary content, no preamble. So start with something like \"该模块实现了 aiohttp 的 StreamResponse 类，用于构建和发送 HTTP 响应...\" etc.\n\nLet's produce a Chinese summary with some English terms.\n\nMake sure not to start with \"This code defines...\" etc. So start directly.\n\nLet's produce a concise but thorough summary.\n\nWe need to mention that the code imports many modules, defines constants, __all__, etc., and the class", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:56:24.352966"}