{"summary": "- This module defines a payload handling system for aiohttp, providing various payload classes (BytesPayload, StringPayload, etc.) to encapsulate different data types (bytes, strings, file-like objects, JSON, async iterables) for HTTP requests/responses.\n- It registers each payload type in a global registry (PAYLOAD_REGISTRY) for dynamic lookup based on input data.\n- Core functions include `get_payload` to create an appropriate payload instance from a given input, and `payload_type` to determine the payload class for a specific type.\n- Payload classes inherit from an abstract base class `Payload`, which defines methods for preparing headers, setting content type, and streaming data via `write` (async). \n- The `Payload` base class also handles the content length (size) and optional `...` (e.g., `Content-Type` header). \n- The module imports various utilities and functions from aiohttp's internal helpers.\n- The module defines a constant `TOO_LARGE_BYTES_BODY` (1 MB) for handling large payloads.\nThe user wants a summary of the functionality of the code. Must start directly with the summary content, no \"This code does...\" etc. Must focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a Chinese summary, maybe with some English terms. Provide details: payload handling system for aiohttp, classes, registry, functions, constants, etc. Provide inputs and outputs: functions accept data and return payload objects; payload objects produce headers and stream data.\n\nLet's craft a concise yet thorough summary.\n\nWe need to start directly with the summary content. So no intro line. Just start.\n\nLet's produce Chinese summary with some English terms.\n\nOk.assistantfinal封装了 aiohttp 的 **Payload** 机制，负责把各种业务数据转换为可在 HTTP 请求/响应中流式发送的负载对象。  \n\n**核心业务逻辑**  \n1. **Payload 基类**（`Payload`）实现了统一的接口：  \n   - `__init__(self, value, *, content_type=None, headers=None, encoding=None)` 接收任意业务数据 `value`，可选 `content_type`、自定义 `headers`、字符编码。  \n   - `size` 属性返回内容长度（若可预估），`headers` 属性返回最终的 HTTP 头部（包括 `Content-Type`、`Content-Length`、`Content-Disposition`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:44.574865"}