{"summary": "We have a Python module `modin/polars/series.py` that defines a class `Series` (presumably subclassing something). The code imports various modules, defines some global variables (`_sorted`, `_descending`, `flags`, `has_validity`, `has_nulls`, `rename`, `alias`). Then defines a method `map_elements` that takes a callable `function`, optional `return_dtype`, and a keyword-only argument `skip_nulls` default True. It warns if `return_dtype` is provided or `skip_nulls` is False, indicating those features are not supported. Then it returns a new Series constructed via `self.__constructor__(values=self.to_pandas().apply(function))`. So the method converts the Series to a pandas Series, applies the function elementwise using pandas `apply`, and wraps the result back into a Modin Polars Series.\n\nThe business logic: element-wise mapping of a series.\nThe inputs: a callable function, optional dtype, skip_nulls flag.\nOutputs: a new Series with transformed values.\n\nNow produce the summary in Chinese.\nThe user wants a summary of the functionality of the code. They gave a snippet of code from modin/polars/series.py. The code defines a method map_elements that maps elements using a function. The summary should be in Chinese (or Chinese/English). They want to start directly with the summary content, no \"This code does...\" or \"Here is...\". So we need to produce a concise summary in Chinese, focusing on business logic, inputs, outputs.\n\nWe should mention that the method is part of a Series class, used for element-wise transformation, converting to pandas, applying function, returning new Series. Also mention that return_dtype and skip_nulls not supported, warning.\n\nLet's produce a Chinese summary. Possibly include English terms for clarity. Ensure no leading phrase like \"This code\". Just start with the summary.\n\nLet's produce something like:\n\n\"在 Modin Polars 的 Series 类中，`map_elements` 方法实现对 Series 中每个元素的函数映射。输入为用户提供的 callable `function`，可选的 `return_dtype` 与 `skip_nulls` 参数目前不被支持，若使用会触发警告。实现上先将当前 Series 转换为 pandas Series，使用 pandas 的 `apply` 逐元素执行 `function`，随后通过内部构造器 `__constructor__` 将结果包装回 Modin Polars Series 并返回。输出为", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:56:15.367271"}