{"summary": "- This code defines a decorator function `new_create_sync` that wraps a given function `func` and adds functionality for handling \n  - ******.\nThe user wants a summary of the functionality of the given code. The code snippet is incomplete; it's a part of a file `instructor/patch.py`. It includes imports, definitions, and a decorator function `new_create_sync`. The user wants a summary in Chinese (or Chinese/English). The summary should start directly with the content, no preamble like \"This code does...\". Should focus on business logic, inputs, outputs. Use Chinese.\n\nWe need to infer the functionality: The decorator wraps a function to add response model handling, templating, context handling, retry logic, hooks, strict validation, etc. It uses Pydantic BaseModel for response model. It supports async and sync via is_async detection elsewhere. It uses tenacity for retries. The decorator returns a response model instance.\n\nWe need to summarize the code: It defines a decorator that, when applied to a function, adds processing of context, templating, response model validation, retry mechanism, and hooks. It takes parameters: response_model, validation_context, context, max_retries, strict, hooks, plus the original function's args and kwargs. It returns an instance of the response_model (a Pydantic model) after calling the original function with retries and processing.\n\nWe need to mention that it uses `handle_context`, `handle_response_model`, `handle_templating`, `retry_sync`, etc. The code uses `mode` variable (likely from import). The decorator is created via `wraps(func)`.\n\nWe need to produce a concise summary in Chinese, maybe with some English terms.\n\nLet's produce a summary:\n\n- 功能: 为任意函数添加统一的请求/响应处理层，包括上下文合并、模板渲染、返回模型校验、重试、钩子、严格模式等。\n- 输入: 原函数的参数; 装饰器参数: response_model (Pydantic模型类型或None), validation_context (字典), context (字典), max_retries (次数或Retrying对象), strict (bool), hooks (Hooks对象), 以及原函数的 *args, **kwargs。\n- 处理: 合并上下文, 根据mode和kwargs决定响应模型, 对kwargs进行模板渲染, 调用 retry_sync 进行带重试的函数执行, 在执行前后触发 hooks", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:43:15.680259"}