{"summary": "- The code defines a function `handle_anthropic_json` that processes a response model and modifies the input arguments for a chat completion request.\n- It extracts system messages from the provided `messages` list and combines them with any existing `system` content.\n- It removes the system messages from the original `messages` list.\n- It constructs a JSON schema message that includes the schema of the model.\n- The function adds a new system message (the JSON schema message) to the `process` (the `...` ... ) \nWe need to produce a summary in Chinese (or Chinese/English) focusing on business logic, inputs, outputs. Must start directly with the summary content, no preamble. So just start with something like:\n\n\"该函数 `handle_anthropic_json` 接收一个 Pydantic 模型类型 `response_model` 和一个包含请求参数的字典 `new_kwargs`，返回处理后的模型类型和更新后的参数字典。...\"\n\nWe need to summarize the functionality of the code snippet. The code snippet includes imports and the function `handle_anthropic_json`. The function extracts system messages from `new_kwargs[\"messages\"]`, combines them with any existing system messages, removes system messages from the messages list, constructs a JSON schema message describing the response model, and adds it to the system messages. It returns the original response model type and the modified kwargs.\n\nWe should mention that it is used for Anthropic JSON handling, presumably for chat completions. The function uses `response_model.model_json_schema()` to get JSON schema.\n\nWe need to mention inputs: `response_model` (type of BaseModel subclass) and `new_kwargs` dict with keys like \"messages\" and optionally \"system\". Output: tuple of (type[T], dict). Business logic: preparing request for Anthropic model to return JSON matching schema.\n\nLet's produce a concise Chinese summary. Also mention that it merges system messages, removes system messages from messages list, adds a system prompt containing JSON schema.\n\nOk.assistantfinal该函数 `handle_anthropic_json` 用于在调用 Anthropic（或类似）聊天模型前，对请求参数进行预处理，以确保模型返回符合指定 Pydantic 模型的 JSON 数据。  \n\n**输入**  \n- `response_model: type[T]`：继承自 `pydantic.BaseModel` 的模型类，决定期望的返回结构。  \n- `new_kwargs: dict[str, Any]`：包含聊天请求的参数", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:44:02.243279"}