{"summary": "We need to summarize the functionality of the code snippet. The snippet is from aiohttp/tracing.py. It imports modules, defines __all__ with many trace parameter classes, defines a generic type variable _T, and defines an async method send_response_chunk_received that sends a trace signal for response chunk received. The method takes method, URL, chunk bytes, and returns await await... It uses self._trace_config.on_response_chunk_received.send(...) with the session, trace config context etc.\n\nThus the summary: The code defines tracing infrastructure for aiohttp client, exposing trace config and parameter classes. The async method send_response_chunk_received triggers a trace event when a response chunk is received, passing method, URL, and chunk data to registered callbacks via the on_response_chunk_received signal. Input: method string, URL object, chunk bytes. Output: awaitable that resolves when all listeners have processed the event (no return value). Also the __all__ defines exported symbols.\n\nWe need to produce summary in Chinese (with English maybe). Must start directly with summary content, no \"This code does...\". So start with something like \"提供 aiohttp 客户端的追踪（tracing）机制，定义了多个 Trace 参数类并通过 Signal 发送事件...\" etc. Provide business logic: tracing of HTTP client events, especially response chunk received. Input: method, URL, chunk. Output: awaitable, triggers callbacks.\n\nLet's produce final answer.assistantfinal提供 aiohttp 客户端的追踪（tracing）机制，导出 `TraceConfig` 及一系列 `Trace*Params` 参数类供外部使用。核心业务逻辑是通过 `Signal` 将特定的 HTTP 事件分发给已注册的回调函数，实现对请求/响应生命周期的监控。\n\n- **输入**：`send_response_chunk_received` 方法接收  \n  1. `method`（请求方法字符串）  \n  2. `url`（`yarl.URL` 实例）  \n  3. `chunk`（响应体的 `bytes` 数据块）  \n\n- **处理**：调用内部的 `_trace_config.on_response_chunk_received.send`，将当前会话对象、追踪上下文以及 `TraceResponseChunkReceivedParams(method, url, chunk)` 参数包装后发送。\n\n- **输出**：返回一个 `awaitable`，在所有注册的监听器处理完该事件后完成；本身不返回具体值，仅用于", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:38:30.067448"}