{"summary": "We have a code snippet from aiohttp/multipart.py. It defines imports and some classes and functions related to multipart handling. The code includes imports of various modules, definitions of __all__, and a function _readline. The snippet is incomplete.\n\nWe need to summarize the functionality of the code. The code is part of aiohttp library for handling multipart HTTP requests/responses. It defines a MultipartReader class, MultipartWriter, BodyPartReader, and functions for parsing content disposition, etc. The code imports many utilities for handling compression, headers, payloads, streams, etc. The function _readline reads a line from the content stream, handling unread buffer.\n\nThus the summary: The code provides utilities for parsing multipart HTTP bodies, reading parts, handling content disposition, etc. It defines a function to read a line from a stream, handling an internal unread buffer.\n\nWe need to output in Chinese. So we can say: 该模块实现了 aiohttp 中的 multipart 读取/写入功能，提供 MultipartReader、MultipartWriter、BodyPartReader 等类，用于解析 multipart/form-data 请求体，支持内容压缩、编码、文件上传等。_readline 方法从流中读取一行数据，若有未读缓存则优先返回。\n\nThus the summary.assistantfinal实现 aiohttp 中的 multipart 处理功能。模块导入了压缩、头部解析、payload、流等工具，公开 `MultipartReader`、`MultipartWriter`、`BodyPartReader`、`parse_content_disposition` 等接口，用于解析和构造 `multipart/form-data`（以及其他 multipart）请求/响应体，支持内容编码、压缩、文件上传等业务场景。内部提供的 `_readline` 异步方法从底层流读取一行字节数据，若存在未读缓存则先返回缓存内容，实现对 multipart 各部分的逐行读取与分割。输入为底层内容流，输出为读取的字节行。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:50:31.729164"}