{"summary": "- Function `select_by_intensity` filters a spectrum based on intensity range.\n- Input: `spectrum_in` (SpectrumType object), optional `intensity_from` (default 10.0) and `intensity_to` (default 200.0).\n- Output: A cloned spectrum with only peaks (mz and intensity) whose intensities lie within `[intensity_to` inclusive). If `spectrum_in` is None, returns None.\n- Validates that `int\n\n`...assistantanalysisThe user wants a summary of the code. The requirements: start directly with the summary content, no \"This code does...\" or \"Here is...\". Focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a summary in Chinese (maybe with some English terms). The code is a function select_by_intensity that filters a spectrum based on intensity range. It clones the input spectrum, asserts intensity_from <= intensity_to, creates a boolean condition where intensities are within the range, then creates a new Spikes object with filtered mz and intensities, assigns to spectrum.peaks, returns the spectrum. If input is None, returns None.\n\nWe need to mention inputs: spectrum_in (SpectrumType), intensity_from, intensity_to. Output: filtered SpectrumType or None. Business logic: filter peaks by intensity range.\n\nWe must start directly with the summary content, no preamble. So start with something like:\n\n\"功能：在给定的谱对象中，根据强度阈值范围筛选峰...\"\n\nWe can include Chinese and English terms. Provide concise summary.\n\nLet's produce final answer.assistantfinal功能：在谱对象（`SpectrumType`）中按强度区间筛选峰。  \n输入：  \n- `spectrum_in`：待处理的谱对象，若为 `None` 则直接返回 `None`。  \n- `intensity_from`（默认 10.0）和 `intensity_to`（默认 200.0）：强度下限和上限，要求 `intensity_from ≤ intensity_to`。  \n处理流程：  \n1. 对输入谱进行深拷贝（`clone()`），保持原始数据不变。  \n2. 使用 NumPy 生成布尔条件，保留强度在 `[intensity_from, intensity_to]` 区间内的峰。  \n3. 根据该条件重新构造", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:40:49.876168"}