{"summary": "We have a code snippet from aiohttp/payload.py. It defines various payload classes for handling HTTP payloads. It imports various modules and defines a registry for payload types.\n\nWe need to summarize the functionality of the code, focusing on business logic, inputs, and outputs. Use Chinese.\n\nWe need to start directly with the summary content, no \"This code does...\" etc.\n\nThus we need to produce a Chinese summary of the code's functionality.\n\nThe code defines a payload registry, payload classes, and a decode method.\n\nWe need to mention that the code defines a registry for payload types, provides functions to get payload, and defines various payload classes for handling different data types (bytes, string, IOBase, etc.) in HTTP requests/responses. It also defines a decode method for reading and decoding an IOBase payload.\n\nThus the summary: \"代码实现了 HTTP payload 的抽象和具体实现，提供了注册表、获取函数、以及多种 payload 类，支持字节、字符串、文件流、JSON、异步迭代等。decode 方法用于将 IOBase 对象读取为字符串。\"\n\nWe need to mention inputs: payload data (bytes, string, file-like objects, JSON, async iterables). Outputs: appropriate Payload objects that can be used by aiohttp for sending HTTP bodies.\n\nThus final answer: Chinese summary.assistantfinal实现了 aiohttp 中 HTTP 请求/响应体的抽象与具体化。代码维护一个全局 `PAYLOAD_REGISTRY`，通过 `payload_type` 装饰器或 `PAYLOAD_REGISTRY` 注册不同数据类型对应的 `Payload` 子类，并提供 `get_payload` 工厂函数，根据输入的数据（bytes、str、IOBase、JSON、AsyncIterable 等）返回相应的 `Payload` 实例。各 `Payload` 子类（如 `BytesPayload`、`StringPayload`、`IOBasePayload`、`JsonPayload`、`AsyncIterablePayload` 等）封装了对不同数据源的读取、编码、Content‑Type 推断以及 `Content‑Disposition` 生成等业务逻辑，供底层 `AbstractStreamWriter` 在发送 HTTP 消息时统一调用。`IOBasePayload.decode` 方法接受可选的字符编码和错误处理方式，将内部的 `io.IOBase` 对象逐行读取并解码为完整的字符串返回。整体上，输入为任意可序列化的 HTTP 负载对象", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:53:42.121469"}