{"summary": "- The script defines a version management system for Python projects using Git. It extracts version information from Git metadata (tags, commits, dirty state) or from the parent directory name of a source archive.\n- Core functions:\n  - `get_keywords` returns a dict of placeholder strings that are replaced by Git during `git-archive`.\n  - `VersioneerConfig` holds configuration parameters (VCS, style etc.\nContinue...\nThe user gave a large code snippet (versioneer.py). The instruction: Summarize functionality, focusing on business logic, inputs, outputs. Use Chinese (Chinese/English). Start directly with summary content, no \"This code does...\" etc. So we need to produce a concise summary in Chinese (maybe with some English terms). Should mention that it's a version management tool for Python projects, using git to compute version numbers, handling various styles (pep440, git-describe, etc.), reading config, handling errors, providing get_versions() function returning dict with version, full-revisionid, dirty, error, date. Also includes registration of VCS handlers, command execution, parsing git describe output, etc.\n\nWe need to start directly with summary content, no preamble. So start with something like:\n\n\"提供基于 Git 的版本号自动生成机制，...\"\n\nMake sure to mention inputs: configuration (setup.cfg), environment (git repo), optional parentdir prefix, etc. Outputs: version string, full revision id, dirty flag, error, date.\n\nAlso mention that there are helper functions for rendering different version styles (pep440, git-describe, etc.) and that the script can be used both at build time and runtime.\n\nLet's craft the answer.assistantfinal提供基于 Git 的 Python 项目版本号自动生成机制，核心流程如下：\n\n1. **配置读取**  \n   - `VersioneerConfig` 从 `setup.cfg`（或硬编码的占位符）获取 `VCS`、`style`、`tag_prefix`、`parentdir_prefix`、`versionfile_source`、`verbose` 等参数。  \n   - 这些参数决定版本号的提取方式（Git、父目录名）以及最终渲染的 PEP 440、git‑describe 等格式。\n\n2. **关键字提取（git‑archive 场景）**  \n   - `get_keywords()` 返回占位符 `%(DOLLAR)sFormat:%...`，在 `git archive` 生成的 tar", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:33:55.836068"}