{"summary": "The code defines a `FileResponse` class (likely extending `StreamResponse`) that handles HTTP file serving with support for conditional requests, range requests, and compression. It determines the file path, stat info (including etag and **...** (continues ...). The prompt says: \"Summarize the functionality of the following code.\" The code is a snippet from aiohttp/web_fileresponse.py. The summary should start directly with the summary content, no \"This code does...\" etc. Should focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a summary in Chinese (maybe with some English terms). Should be concise but cover main points: handling HTTP file response, reading request headers, handling conditional GET (If-None-Match, If-Modified-Since, etc.), handling range requests (partial content), setting appropriate status codes (200, 206, 304, 416, 403, 404), determining content type and encoding, using sendfile or reading file, handling errors, etc. Also mention environment variable AIOHTTP_NOSENDFILE, fallback content type, additional content types mapping, etc.\n\nThe code snippet includes imports, constants, and the async prepare method. The summary should describe that the method prepares the response based on request, determines file path, checks existence, permissions, file type, calculates ETag, Last-Modified, handles preconditions, range requests, sets headers, content length, content type, encoding, and then sends file using sendfile or fallback.\n\nWe need to start directly with the summary content, no preamble. Use Chinese. Let's produce a concise but thorough summary.\n\nLet's write:\n\n\"FileResponse 类在 aiohttp 中实现文件下载/浏览的 HTTP 响应。其核心 async prepare 方法接受 BaseRequest 对象作为输入，根据请求头（Accept-Encoding、If-Match、If-None-Match、If-Modified-Since、If-Unmodified-Since、Range、If-Range 等）执行以下业务逻辑：...\"\n\nThen list steps.\n\nMake sure not to start with \"This code does...\" but start directly with the summary.\n\nLet's produce final answer.assistantfinalFileResponse 类在 aiohttp 框架中实现文件的 HTTP 响应，核心业务逻辑位于 `async prepare(request)` 方法：\n\n1. **输入**：`request`（BaseRequest），包含路径、请求方法、所有 HTTP 头部。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:36:44.204906"}