{"summary": "The provided code defines a `Template` class that manages ****... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... \nWe need to produce a summary of the functionality of the code snippet. The snippet includes imports, __all__, constants for step kinds, a list stepkinds, and a method prepend defined inside a class (presumably Template). The code snippet is incomplete; only the prepend method is shown. The summary should focus on business logic, inputs, outputs. Use Chinese (with English maybe). Must start directly with summary content, no \"This code does...\". So we need to produce a concise description: The code defines a Template class for building pipeline steps; constants represent different I/O configurations; prepend method adds a step at the front of the pipeline, validates command string and kind, ensures proper placeholders $IN and $OUT for file-based steps, prevents invalid placements like SINK at front or multiple SOURCE, raises TypeError/ValueError accordingly. Input: cmd string, kind string; output: modifies self.steps list (in-place) by inserting tuple (cmd, kind) at index 0; raises errors if validation fails.\n\nWe need to mention that __all__ includes Template, imports re, os, tempfile, warnings, quote. The constants define pipeline step types: FILEIN_FILEOUT, STDIN_FILEOUT, FILEIN_STDOUT, STDIN_STDOUT, SOURCE, SINK. stepkinds list includes them.\n\nThe prepend method ensures command string contains $IN placeholder when input is file, $OUT placeholder when output is file. It also ensures SINK cannot be prepended, SOURCE cannot be duplicated at start.\n\nThus summary: The code implements a pipeline template builder with step validation.\n\nNow produce final answer in Chinese (maybe with some English terms). Must start directly with summary content. No preamble.\n\nLet's craft:\n\n\"提供一个用于构建数据处理流水线的 Template 类，...\"\n\nOk. Let's write.assistantfinal提供一个用于构建数据处理流水线的 **Template** 类核心逻辑：  \n\n- **常量定义**：`FILEIN_FILEOUT、STDIN_FILEOUT、FILEIN_STDOUT、STDIN_STDOUT、SOURCE、SINK` 表示六种步骤的 I/O 组合方式（文件输入/输出、标准输入/输出、流水线起点/终点），并统一保存在 `stepkinds` 列表中供后续校验使用。  \n- **prepend", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:01:07.606126"}