{"summary": "The code defines a ****.\nThe **...**.\nThe **...**...\nThe ... ... ... ... ... ... ... ......\nWe need to produce a summary of the functionality of the code, focusing on business logic, inputs, outputs. Use Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" etc. So we need to produce a concise description.\n\nLet's analyze the code.\n\nFile: instructor/cli/usage.py\n\nImports: typing, collections, datetime, typer, os, aiohttp, asyncio, rich console, table, progress, ModelNames alias.\n\nDefine a Typer CLI app: app = typer.Typer()\n\nConsole for rich output.\n\napi_key from env var OPENAI_API_KEY.\n\nMODEL_COSTS dict mapping model names to cost per token for prompt and completion (or just a float for embeddings). Many models.\n\nFunction get_model_cost(model: ModelNames) -> Union[dict[str,float], float]:\n- Returns cost details for a given model.\n- If model in MODEL_COSTS, return that entry.\n- Else, handle prefixes: gpt-3.5-turbo-16k, gpt-3.5-turbo, gpt-4-turbo, gpt-4-32k, gpt-4o, gpt-4.\n- If none matches, raise ValueError.\n\nThus the business logic: Provide a CLI tool to query usage cost? Actually only function defined. The code likely part of CLI usage command to compute cost of usage based on token counts. But only function defined.\n\nThe summary should mention that the code defines a mapping of OpenAI model token pricing, reads API key, sets up CLI app, and provides a function to retrieve cost info for a given model, handling exact matches and prefix fallback, raising error if unknown.\n\nInputs: model name (string/ModelNames). Output: cost dict or float.\n\nAlso mention that the cost dict contains 'prompt' and 'completion' per token rates; for embedding models it's a single float.\n\nLet's craft summary in Chinese.\n\nStart directly with summary content.\n\nWill include mention of Typer CLI and Rich console but not necessary for function.\n\nLet's produce final answer.assistantfinal提供 OpenAI 模型费用查询的业务逻辑。  \n- 通过 `os.environ.get(\"OPENAI_API_KEY\")` 读取环境变量 `OPENAI_API_KEY`，为后续调用 OpenAI 接口准备凭证。  \n- 使用 `typer.Typer", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:55:27.776622"}