{"summary": "We need to summarize the functionality of the code snippet. The snippet is from scripts/release.py, imports various modules, defines a method __resolve_cache that takes name and email, returns self.__cache.get(f\"{name} <{email}>\", None). So the code is part of a class that has a __cache attribute, likely a dict mapping \"Name <email>\" to something. The method resolves a cache entry for a given name/email. The overall script likely deals with releasing something, interacting with GitHub, packaging version, etc. But only this snippet is shown. So we summarize that the function resolves a cached value for a user identifier composed of name and email, returning None if not found. The script imports many modules for argument parsing, atexit, collections, json, regex, sys, pathlib, github API, pygit2, packaging.version. So the script likely handles release automation, resolves GitHub user info, caches it, etc. The __resolve_cache method is a private helper that looks up a cache dictionary using a formatted string \"Name <email>\" as key.\n\nThus summary: The script is a release automation tool that interacts with GitHub, git, and packaging version. It includes a private method __resolve_cache that retrieves a cached entry for a given author name and email from an internal cache dictionary, returning None if not present. Input: name, email strings; output: cached value or None.\n\nWe need to output in Chinese (with English optionally). So something like:\n\n\"该脚本用于自动化发布流程，涉及 GitHub、git、版本管理等。内部定义了一个私有方法 __resolve_cache(name, email)，它根据传入的姓名和邮箱拼接成 'Name <email>' 键，从实例的 __cache 字典中查找对应的缓存值，若不存在返回 None。\"\n\nThat's it. No extra fluff.assistantfinal该脚本是用于自动化发布流程的工具，涉及 GitHub、git、版本管理等业务逻辑。内部实现了一个私有方法 `__resolve_cache(name, email)`，其业务功能为：\n\n- **输入**：`name`（字符串）和 `email`（字符串）。\n- **处理**：将姓名和邮箱拼接成 `\"Name <email>\"` 形式的键。\n- **输出**：从实例的 `self.__cache`（通常为字典）中查找该键对应的缓存值，若未命中则", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:43:33.362562"}