{"summary": "The code defines a test case for a function `select_by_relative \nWe need to produce a summary of the functionality of the code. The code is a test file for a function select_by_relative_intensity. It imports Spectrum, select_by_relative_intensity, numpy, pytest. It defines a test function test_select_by_relative_intensity_with_to_parameter. It creates a spectrum with mz and intensities arrays. Then calls select_by_relative_intensity with intensity_to=0.99. Then asserts that the resulting spectrum has 3 peaks, that mz and intensities sizes match, and that the mz and intensities arrays equal expected values (first three peaks). So the test verifies that the function filters out peaks above a relative intensity threshold (0.99 of max intensity). The function likely removes peaks whose intensity relative to max is greater than intensity_to? Actually intensity_to=0.99 means keep peaks with relative intensity <=0.99? The max intensity is 1000, relative intensities: 0.001,0.01,0.1,1. So threshold 0.99 would drop the last peak (1 >0.99). So keep first three. So test verifies that.\n\nThus summary: The test checks that select_by_relative_intensity correctly filters a Spectrum by relative intensity threshold, removing peaks above the given proportion of the maximum intensity, and returns a Spectrum with matching mz and intensity arrays.\n\nNow produce summary in Chinese (with some English maybe). Must start directly with summary content, no \"This code does...\". So start with something like \"验证 select_by_relative_intensity 函数在给定相对强度阈值时的过滤行为...\" Provide business logic, inputs, outputs. Use Chinese. Let's produce.assistantfinal验证 `select_by_relative_intensity` 在相对强度阈值 `intensity_to=0.99` 下的过滤逻辑。  \n- **输入**：构造的 `Spectrum` 对象，包含四个峰的 m/z 数组 `[10, 20, 30, 40]` 与对应强度数组 `[1, 10, 100, 1000]`（相对强度分别为 0.001、0.01、0.1、1）。  \n- **业务逻辑**：函数根据相对强度阈值（相对于最大强度的比例）筛选峰，保留相对强度 ≤ 0.99", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:36:16.810867"}