{"summary": "We need to summarize functionality of the code snippet. The snippet is from modin/polars/series.py. It imports modules, defines some variables, and defines a method replace_strict in a class (presumably Series). The method is not implemented (raises NotImplementedError). So the business logic: placeholder for strict replace operation on a Series, with parameters old, new, default, return_dtype. Input: old values, new values, optional default, optional return dtype. Output: a new Series with replaced values. Currently not implemented.\n\nThus summary: The code sets up imports for Modin Polars integration, defines some module-level flags, and declares a replace_strict method for a Series class that is intended to replace values strictly but currently raises NotImplementedError. No actual logic.\n\nWe need to output in Chinese (with maybe English). Provide summary. No \"This code does...\" etc. So start directly with summary content.\n\nLet's produce.assistantfinal该文件为 Modin 对 Polars 的 Series 封装准备环境，导入了 `numpy`、`pandas`、`polars` 以及 Modin 内部的查询编译器、错误处理等模块，并在模块级别声明了 `_sorted`、`_descending`、`flags`、`has_validity`、`has_nulls`、`rename`、`alias` 等全局变量（用于后续数据属性标记）。  \n\n核心业务逻辑体现在 `replace_strict` 方法的签名上：  \n- **输入**：`old`（待替换的旧值），`new`（对应的新值，默认 `no_default`），`default`（未匹配时的默认值，默认 `no_default`），以及可选的 `return_dtype`（返回 Series 的数据类型）。  \n- **预期输出**：返回一个已完成严格值替换的 `Series` 实例。  \n\n当前实现仅抛出 `NotImplementedError(\"not yet\")`，表明该功能尚未完成，后续需在此处加入基于 Polars 的严格替换逻辑。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:58:06.610676"}