{"summary": "The code defines a tracing module for aiohttp, a Python asynchronous HTTP client/server library. It imports necessary modules and defines a `TraceConfig` class with various trace event parameters. The `TraceConfig` class provides a property `on_connection_create_end` which returns a signal (a callback function) that can be used to monitor or debug the end of a connection creation.\nThe user wants a summary of the functionality of the code. They gave a snippet of code from aiohttp/tracing.py. They want a summary in Chinese (or Chinese/English). They also gave requirements: start directly with the summary content, no \"This code does...\" or \"Here is...\". Focus on business logic, inputs, outputs. Use Chinese.\n\nWe need to produce a summary of the code's functionality: it's a tracing module for aiohttp, defines TraceConfig class, various trace event parameter classes, and a property on_connection_create_end returning a Signal for callbacks.\n\nWe need to mention inputs and outputs: the TraceConfig class is used to configure tracing; the property returns a Signal object that can be used to attach callbacks for the end of connection creation events. The code imports modules, defines __all__, defines a generic type variable, and defines a property.\n\nWe need to start directly with the summary content, no \"This code does...\". So start with something like \"提供 aiohttp 的追踪配置...\" etc.\n\nLet's produce a concise summary in Chinese, maybe with some English terms.\n\nWe need to mention business logic: tracing of HTTP client events, connection creation, DNS resolution, request/response lifecycle, etc. The snippet only shows part of the file, but we can infer the overall purpose.\n\nWe need to mention inputs: the TraceConfig class can be instantiated with optional callbacks; the property returns a Signal that expects callbacks with specific parameter types (TraceConnectionCreateEndParams). Output: the Signal object.\n\nLet's produce a summary.assistantfinal提供 aiohttp 异步 HTTP 客户端/服务器的全链路追踪配置。  \n- 通过 `TraceConfig` 类集中管理多种事件的回调参数类型（如请求开始/结束、异常、连接队列、连接创建、DNS 解析、重定向、数据块发送/接收、请求头发送等），并在 `__all__` 中导出对应的参数数据结构。  \n- `TraceConfig` 内部维护多个 `Signal[_SignalCallback[...]]` 实例，`on_connection_create_end", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:37:49.121639"}