{"summary": "We need to summarize the functionality of the code snippet. The snippet is from aiohttp/payload.py. It defines imports, constants, types, a registry, default content type, and a method set_content_disposition. The code defines a Payload class hierarchy for handling HTTP request/response bodies. The snippet includes definitions of constants, type aliases, and a method for setting Content-Disposition header. The summary should focus on business logic, inputs, outputs. Provide Chinese.\n\nLet's craft a concise summary: The module provides a registry for payload types, a function to retrieve payload based on data, and a base Payload class with methods to set headers, compute size, and stream data. The set_content_disposition method builds a Content-Disposition header from disposition type and parameters, handling quoting and charset. The module also defines specific payload subclasses for bytes, strings, file-like objects, JSON, async iterables, etc., each converting the input into an appropriate HTTP body and content-type.\n\nWe need to mention inputs: data (bytes, str, IO, async iterable, JSON). Outputs: an instance of Payload that can be written to an AbstractStreamWriter, with appropriate headers (Content-Type, Content-Length, Content-Disposition). Also mention constants: TOO_LARGE_BYTES_BODY threshold for in-memory vs streaming.\n\nLet's produce final answer.assistantfinal提供一套 **HTTP 消息体（payload）抽象与实现**，用于在 aiohttp 中统一处理请求/响应的 body。  \n\n### 关键业务逻辑  \n1. **Payload 注册与获取**  \n   - `PAYLOAD_REGISTRY`（`PayloadRegistry` 实例）保存 **数据类型 → Payload 子类** 的映射。  \n   - `get_payload(data, *, content_type=None, **kwargs)`（未在片段中出现但在模块其余部分实现）根据传入的 **data** 类型（bytes、str、IO、async iterable、JSON 等）查表并实例化对应的 `Payload` 子类，返回可写入网络流的对象。  \n\n2. **统一的 Payload 基类**  \n   - `class Payload(ABC)` 定义 **headers、content_type、size、write(writer)** 等抽象/默认实现。  \n   - `set_content_disposition(disptype, quote_fields=True, _charset='utf-8', **params)`：  \n     - **输入**：`disptype`（如 `'attachment'`、`'inline'`），可选的 `", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:53:00.939522"}