{"summary": "- The code defines a multipart handling module for aiohttp, providing classes and utilities to parse and construct multipart HTTP messages.\n- Core classes include `MultipartReader` for reading multipart data, `MultipartWriter` for creating multipart bodies, and `BodyPartReader` for reading individual parts.\n- It imports various utilities for handling encoding, compression, MIME types, and HTTP headers.\n- The module supports asynchronous iteration over multipart parts, allowing `async for` usage.\n- It defines type aliases and helper functions for content disposition parsing and filename extraction.\n- The module integrates with aiohttp's payload system, enabling automatic conversion between raw data and appropriate payload objects.\n- The `__anext__` method implements asynchronous iteration protocol, fetching the next part or raising `StopAsyncIteration` when done.\nThe user wants a summary of the functionality of the code. Must start directly with the summary content, no \"This code does...\" etc. Must focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a Chinese summary (maybe mixed). Provide concise description of what the module does, its classes, functions, inputs/outputs.\n\nThe code snippet is part of aiohttp multipart handling. Provide summary: defines multipart reader/writer, parsing content disposition, handling payloads, async iteration.\n\nLet's craft answer.assistantfinal提供对 HTTP **multipart** 消息的完整解析与构造能力，主要用于 **aiohttp** 框架的请求/响应处理。\n\n**核心业务逻辑**  \n1. **MultipartReader**  \n   - 输入：`StreamReader`（或任意可读取的二进制流）以及 `Content-Type` 中的 `boundary`。  \n   - 通过逐段读取流并依据 MIME 边界分割，返回 **BodyPartReader** 实例。  \n   - 支持 `async for part in reader` 形式的异步迭代；内部实现 `__anext__`，在没有更多段时抛出 `StopAsyncIteration`。\n\n2. **MultipartWriter**  \n   - 输入：目标 `StreamWriter`（或任意可写对象）和可选的 `boundary`。  \n   - 通过 `append_payload`、`append_form` 等方法把 **Payload**（如 `JsonPayload`、`StringPayload`）包装成符合 RFC 2046 的 multipart 章节，并写入底层流。  \n   - 输出：完整", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:49:59.804841"}