{"summary": "The code defines a test case using pytest pytest-parameterized ****.\nWe need to produce a summary in Chinese (or Chinese/English). The summary should start directly with the content, no preamble. Should focus on business logic, inputs, outputs. The code is a test file for LLM (Gemini) with retries using tenacity. It defines a parametrized test over models and modes. It creates an instructor client from Gemini model, sets up a tenacity Retrying object with stop after 2 attempts and wait 1 second. Then calls client.chat.completions.create with response_model=UserDetail, messages containing a request to extract \"jason is 12\". It passes max_retries=retries. Then asserts response.name == \"JASON\". So the business logic: test that the LLM client correctly extracts name and uppercases it, with retry logic.\n\nWe need to summarize functionality: It runs a parametrized test across combinations of LLM models and operation modes, constructs a Gemini client via instructor, configures retry policy using tenacity (max 2 attempts, 1 sec wait), sends a chat completion request to extract user details from a string, expects the response model to have name field uppercased to \"JASON\". Input: model name, mode, message content. Output: asserts that response.name equals \"JASON\". Also uses UserDetail model (not shown) presumably defined elsewhere.\n\nLet's produce summary in Chinese. Ensure no \"This code does...\" etc. Just start with summary. Use Chinese. Provide business logic, inputs, outputs. Let's do it.assistantfinal对 Gemini LLM 客户端进行参数化单元测试，遍历 `models` 与 `modes` 的笛卡尔积。  \n- **输入**：  \n  1. `model`（模型标识）和 `mode`（调用模式），由 pytest 参数化提供。  \n  2. 消息体 `{\"role\": \"user\", \"content\": \"Extract `jason is 12`\"}`，要求模型从文本中提取用户信息。  \n  3. `UserDetail` 响应模型（定义了 `name` 等字段）。  \n  4. 重试策略 `Retrying(stop=stop_after_attempt(2), wait=wait_fixed(1))`，最多重试 2 次、每次间隔 1 秒。  \n- **业务逻辑**：  \n  1.", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:01:57.815347"}