{"summary": "We need to summarize the functionality of the code snippet. The code is from aiohttp/web_fileresponse.py, defines FileResponse class. The snippet includes imports, constants, and a private async method _not_modified that handles HTTP 304 Not Modified response. The summary should focus on business logic, inputs, outputs.\n\nWe need to produce Chinese summary. Provide direct summary without \"This code does...\". So start with something like \"实现文件响应...\" etc.\n\nLet's craft summary: It defines constants for MIME type detection, encoding extensions, fallback content type, additional content types. It defines a flag NOSENDFILE based on env var. It defines a type alias for callback on chunk sent. It defines async method _not_modified that sets response status to 304, disables length check, sets ETag and Last-Modified headers, removes Content-Length, and prepares the response for the request, returning a stream writer (or None). The method is part of FileResponse class (not shown) used to handle conditional GET requests.\n\nWe need to mention inputs: request object, etag_value (string), last_modified (float). Output: Optional[AbstractStreamWriter] (prepared response writer). Business logic: handling conditional GET, sending 304 Not Modified.\n\nAlso mention that the module imports many aiohttp components, defines MIME handling, etc.\n\nLet's produce final answer.assistantfinal实现基于 aiohttp 的文件下载响应（`FileResponse`）的核心业务逻辑。  \n\n- **输入**  \n  - `request: BaseRequest` – 客户端的 HTTP 请求对象。  \n  - `etag_value: str` – 资源的 ETag 标识，用于缓存校验。  \n  - `last_modified: float` – 资源的最后修改时间戳（POSIX 时间）。  \n\n- **内部处理**  \n  - 读取环境变量 `AIOHTTP_NOSENDFILE`，决定是否禁用底层 `sendfile` 系统调用。  \n  - 使用 `mimetypes.MimeTypes` 自动推断文件的 MIME 类型；若无法识别则回退为 `application/octet-stream`。  \n  - 维护 `ENCODING_EXTENSIONS` 与 `ADDITIONAL_CONTENT_TYPES` 两套映射，用于识别压缩后缀（`.gz`, `.br` 等）并设置对应的 `Content‑Encoding`。  \n  - 定义 `_not_modified` 异步私有方法，用", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:36:31.414295"}