{"summary": "The code defines a TraceConfig class in the aiohttp/tracing.py module. It imports various modules and defines a list of exported symbols. The class includes a property called \"on_connection_queued_start\" that returns a Signal object. This property is used for tracing the start of a connection.\nThe user wants a summary of the functionality of the code, focusing on business logic, inputs, outputs, in Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" or \"Here is...\". So we need to produce a concise summary in Chinese (maybe with some English terms). The code snippet is partial, but we can infer the functionality: defines TraceConfig class for aiohttp tracing, includes signals for various events (request start/end, connection queued start/end, DNS resolve start/end, etc.). The property on_connection_queued_start returns a Signal that can be used to attach callbacks for when a connection is queued. The inputs are the TraceConfig instance; outputs are Signal objects. Business logic: provides tracing hooks for aiohttp client operations.\n\nWe need to summarize the functionality: defines tracing configuration, signals for events, property returns signal for connection queued start.\n\nLet's produce a Chinese summary, maybe with some English terms like \"TraceConfig\", \"Signal\". Ensure we start directly with the summary content, no preamble. Let's do it.assistantfinal提供 aiohttp 客户端的 **TraceConfig** 配置类，用于在请求生命周期的各个关键节点挂载自定义回调，实现细粒度的运行时追踪。  \n- **输入**：创建 `TraceConfig` 实例时可选传入自定义回调或在实例化后通过属性注册回调。  \n- **核心业务逻辑**：在类内部预定义一组 `Signal[_SignalCallback[...]]` 对象，分别对应请求开始/结束、异常、连接排队、连接创建、DNS 解析、重定向、数据块发送/接收等事件。每个 `Signal` 充当事件分发器，用户可以通过 `+=` 或 `connect` 方法注册异步回调函数。  \n- **输出**：对应属性（如 `on_connection_queued_start`）返回相应的 `Signal` 实例，调用该 `Signal` 时会依次触发已注册的回调，回调接收特定的参数对象（如 `TraceConnectionQueuedStartParams`），", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:37:36.700614"}