{"summary": "- The `reask_gemini_tools` function handles validation errors when interacting with Gemini's generative language API.\n- It takes a dictionary `kwargs` (the request payload for Gemini), a `response` object containing the original response from the API.\n- It adds a `function` role message (function call) to the ****.\n```\"\n\nWe need to produce a summary of the functionality of the code. The code is a Python module `instructor/reask.py`. It imports various modules, defines type variables, and defines a function `reask_gemini_tools`. The function takes `kwargs: dict[str, Any]`, `response: Any`, and `exception: Exception`. It imports `google.ai.generativelanguage as glm`. It constructs `reask_msgs`, a list of two messages: one with role \"function\" and parts containing a `glm.Part` with a `function_response` that includes the function name from the original response and a response dict with an error message containing the exception. The second message has role \"user\" and parts with a string prompting to recall the function arguments correctly and fix the errors. Then it extends `kwargs[\"contents\"]` with these messages and returns `kwargs`.\n\nThus the function modifies the request payload to include a re-ask message for Gemini to correct validation errors.\n\nThe summary should be in Chinese (with possibly English terms). It should start directly with the summary content, no preamble. Should focus on business logic, inputs, outputs.\n\nThus produce something like:\n\n- 功能: 处理 Gemini API 调用时的验证错误，向请求中追加重新询问的消息，使模型重新生成正确的函数参数。\n- 输入: `kwargs`（Gemini 请求的 payload，必须包含 `contents` 列表），`response`（原始 Gemini 响应，包含函数调用信息），`exception`（捕获的验证异常）。\n- 处理: 从 `response` 中提取函数名，构造两条消息：一条 `function` 角色的错误报告，包含函数名和错误信息；另一条 `user` 角色的提示，要求模型回忆并修正函数参数。将这两条消息追加到 `kwargs[\"contents\"]`。\n- 输出: 返回修改后的 `kwargs`，用于再次发送给 Gemini。\n\nMake sure to start directly with the summary content. Use Chinese. Possibly include English terms like \"function\", \"user\". Provide concise bullet points.\n\nLet's produce that", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:41:03.529284"}