{"summary": "We need to summarize the functionality of the code snippet. The code is from aiohttp/payload.py. It defines a PayloadRegistry class and registers various payload types. It imports many modules. It defines constants, types, and a registry. The code snippet includes imports, __all__, constant TOO_LARGE_BYTES_BODY, type alias PayloadType, tuple type _PayloadRegistryItem, and initialization of PAYLOAD_REGISTRY = PayloadRegistry() with internal lists.\n\nWe need to summarize business logic, inputs, outputs. The code defines a registry for payload handling in aiohttp. It registers payload classes for different data types (bytes, string, IO, JSON, async iterables). The registry maps Python types to payload classes and optional conditions. The get_payload function (not shown) would retrieve appropriate payload class based on data type and content type. The payload classes implement AbstractStreamWriter to produce HTTP request bodies.\n\nThus summary: The module provides a registry that maps Python objects to appropriate Payload subclasses for HTTP request/response bodies. It defines constants, type hints, and registers default payload handlers. The registry can be queried to get a payload instance for a given data and optional content type. The payload classes handle serialization (e.g., JSON encoding, text encoding) and streaming.\n\nWe need to output in Chinese (with English optional). Provide summary directly.\n\nLet's produce final answer.assistantfinal提供了 aiohttp 中用于 HTTP 消息体序列化的统一管理机制。核心是 **PayloadRegistry**，在模块加载时实例化为全局变量 **PAYLOAD_REGISTRY**，内部维护三段有序列表（_first、_normal、_last），用于存放 **(PayloadClass, condition)** 形式的注册项。  \n\n业务逻辑  \n- 根据不同的 Python 对象类型（bytes、str、IO、JSON、AsyncIterable 等）以及可选的额外判断条件，注册对应的 **Payload** 子类。  \n- 当外部调用 `get_payload(data, content_type=None, ...)`（未展示）时，注册表按顺序遍历这些列表，找到首个满足 `isinstance(data, type) and condition(data)` 的条目，实例化相应的 Payload 并返回。  \n- Payload 子类实现 `AbstractStreamWriter` 接口，负责把对象转换为 HTTP 请求/响应的字节流（包括自动设置 `Content-Type`、`Content-Length`、`Content-Disposition` 等头部），并在", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:23.620743"}