{"summary": "- This module defines a payload handling system for aiohttp, providing various payload classes for different data types (bytes, strings, file-like objects, JSON, async iterables).\n- It includes a registry (`PAYLOAD_REGISTRY`) to map Python types to corresponding payload classes, allowing dynamic payload creation via `get_payload`.\n- Core abstract class `Payload` defines common interface: content type, size, headers, and async `write` method to stream data to an `AbstractStreamWriter`.\n- Subclasses implement specific serialization:\n  - `BytesPayload` for raw bytes, sets `Content-Type` to default or provided.\n  - `StringPayload` encodes strings to bytes using specified charset.\n  - `IOBasePayload` handles generic file-like objects, guessing MIME type from filename.\n  - `BytesIOPayload`, `BufferedReaderPayload`, `TextIOPayload`, `StringIOPayload` are specialized for respective IO classes.\n  - `JsonPayload` serializes Python objects to JSON bytes, with optional custom encoder.\n  - `AsyncIterablePayload` streams async iterables as chunked.\n- Utility functions like `payload_type` register/register/ ? ? ? ... (the code snippet is incomplete). \nThe task: Summarize functionality of the given code. Must start directly with summary content, no preamble. Must focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). Provide summary.\n\nWe have code snippet from aiohttp/payload.py. It defines payload handling system for aiohttp. Provide details: registry, get_payload, payload_type decorator, Payload abstract class, various subclasses for different data types, size property, etc.\n\nNeed to incorporate inputs and outputs: The payload classes accept data (bytes, str, file-like, JSON, async iterable) and produce HTTP request body with appropriate headers, content type, size, and streaming via write method to AbstractStreamWriter.\n\nAlso mention constants: TOO_LARGE_BYTES_BODY = 1 MB, default content type.\n\nWill produce Chinese summary with some English terms.\n\nLet's craft.\n\nAlso note that code snippet incomplete; but we can infer.\n\nWill mention that PayloadRegistry is used to map types to payload classes.\n\nWill mention that get_payload returns appropriate Payload instance given data and optional content_type, encoding, etc.\n\nWill mention that size property returns optional int.\n\nWill mention that each subclass overrides methods: __init__, get_headers, write.\n\nWill mention that JsonPayload uses json.dumps with JSONEncoder.\n\nWill mention that AsyncIterablePayload streams", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:39.561093"}