{"summary": "- The function `update_total_usage` aggregates token usage statistics from a response object into a cumulative usage tracker.\n- Input parameters:\n  - `response` (optional): An object of a type derived from `Response` that may contain a `usage` attribute with token counts.\n  - `total_usage` :  the     ... ... ... ... ... ... ... ... ... ... \nWe need to produce final answer: a summary in Chinese (or Chinese/English) focusing on business logic, inputs, outputs. Must start directly with summary content, no preamble. Provide concise description.\n\nWe need to read the code: It's a function update_total_usage that takes response (optional) and total_usage (OpenAIUsage or AnthropicUsage). It updates total_usage by adding usage from response. Handles OpenAI usage details (completion_tokens, prompt_tokens, total_tokens, and token details). For Anthropic usage, adds input_tokens and output_tokens. Returns updated response (or ChatCompletion?) Actually return type is T_Model | ChatCompletion | None. It returns response after updating its usage attribute to total_usage. If response is None returns None. If usage types not compatible, logs debug and returns response unchanged.\n\nThus summary: function aggregates token usage from a single LLM response into a cumulative usage object, supporting both OpenAI and Anthropic usage structures, updates response's usage field, returns the response (or None). Input: response object possibly containing usage attribute; total_usage cumulative usage object. Output: updated response or None.\n\nLet's craft final answer. Use Chinese with occasional English terms. Ensure start directly with summary content. No \"This code does\". Provide business logic.\n\nLet's produce final answer.assistantfinal聚合并累计大语言模型（LLM）调用的 token 使用量。  \n**输入**  \n- `response`（可选）：实现自定义 `Response` 基类的对象，通常包含 `usage` 属性，记录本次调用的 token 消耗。  \n- `total_usage`：累计的使用统计对象，支持 OpenAI (`openai.types.CompletionUsage`) 或 Anthropic (`anthropic.types.Usage`) 两种结构。  \n\n**业务逻辑**  \n1. 若 `response` 为 `None`，直接返回 `None`。  \n2. 读取 `response.usage`，判断其类型：  \n   - **OpenAI**：将本次 `completion_tokens`、`prompt_tokens`、`total_tokens`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:39:50.762632"}