{"summary": "The code defines a pytest plugin for aiohttp that enables running coroutine test functions within an event loop. It checks if a test function is a coroutine, retrieves an existing event loop fixture if available, and then executes the coroutine using the loop's `run_until_complete` method. The plugin also supports a `--aiohttp-fast` option to control the speed of the test execution. The function `pytest_pyfunc_call` returns a boolean indicating whether the test function was successfully executed.\nWe need to produce a summary of the functionality of the code, focusing on business logic, inputs, outputs, in Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" or \"Here is...\". So just a paragraph summarizing.\n\nThe code is a pytest plugin for aiohttp. It defines a function pytest_pyfunc_call that intercepts test function calls. It checks if the test function is a coroutine, obtains existing event loop fixtures (proactor_loop or loop), uses a context manager _runtime_warning_context and _passthrough_loop_context to get a loop (maybe fast mode). It builds testargs from fixture arguments and runs the coroutine with loop.run_until_complete. Returns True to indicate handled.\n\nThus summary: 业务逻辑: 在 pytest 执行测试函数时，如果函数是 async coroutine，则在事件循环中运行；输入: pytest 的 pyfuncitem 对象，包含测试函数及其 fixture 参数；输出: 返回 True 表示已处理，实际执行结果由 coroutine 完成，可能抛异常。 Also mentions --aiohttp-fast option.\n\nLet's produce Chinese summary. Ensure no leading \"This code...\" etc. Just start with summary. Use Chinese. Provide business logic, inputs, outputs. Let's do it.assistantfinal在 pytest 执行测试用例时，拦截每个函数调用 (`pytest_pyfunc_call`) 并判断该函数是否为 `async` 协程；若是，则尝试从 fixture 中获取已有的事件循环（`proactor_loop` 或 `loop`），在 `_runtime_warning_context` 与 `_passthrough_loop_context`（可通过 `--aiohttp-fast` 参数控制是否使用快速模式）包装的上下文中，以 `loop.run_until_complete` 方式运行该协程。函数通过收集 `pyfuncitem._fixtureinfo.argnames` 对应的 fixture 实例构造调用参数字典 `testargs`，随后将其传递给原始", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:58:50.852536"}