{"summary": "We need to summarize functionality of code snippet. It's from aiohttp/web_response.py. It defines StreamResponse class, imports, constants, etc. Provide business logic, inputs, outputs. Use Chinese. Provide summary directly.\n\nLet's craft summary: The module defines HTTP response handling for aiohttp server. It includes ContentCoding enum, StreamResponse class with attributes for status, headers, body, cookies, compression, chunked transfer, keep-alive, etc. It provides methods to set status, reason, headers, cookies, payload, prepare response with request, send body, handle compression (gzip/deflate) using ZLibCompressor, manage content length, chunked encoding, ETag handling, conditional responses, etc. Also defines convenience functions json_response, Response subclass. Input: request object, payload data (bytes, str, dict, etc.), optional parameters like status, headers, content_type, encoding, etc. Output: an aiohttp.web.Response object that can be written to the client via the underlying transport, producing HTTP status line, headers, optional body, possibly compressed, chunked, etc.\n\nLet's produce Chinese summary.assistantfinal实现了 aiohttp 框架的 HTTP 响应对象及其核心业务逻辑。  \n\n- **核心类** `StreamResponse`（以及其子类 `Response`）封装了服务器向客户端返回的完整 HTTP 报文。  \n- **输入**：  \n  1. **请求对象**（`request`），在 `prepare()` 时传入，用于决定 keep‑alive、HTTP 版本、是否支持压缩等协商。  \n  2. **响应体**：可以是 `bytes`、`bytearray`、`str`、`dict`、`Payload` 等任意可序列化对象；也可以通过 `json_response()` 直接传入 JSON 数据。  \n  3. **可选参数**：`status`、`reason`、`headers`、`content_type`、`charset`、`cookies`、`compress`、`chunked`、`payload_writer` 等，用于定制状态码、原因短语、响应头、内容编码、是否分块传输、是否强制压缩等。  \n\n- **业务流程**：  \n  1. **构造**时收集状态码、原因短语、默认/自定义头部、Cookie 集合等信息。  \n  2.", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:56:54.638741"}