{"summary": "The code defines a fixture fixture (...).\nWe need to summarize the functionality of the given code. The code is a test file for function calls. It imports various types from anthropic, openai, pydantic, instructor, etc. It defines a generic type variable T. Then defines a pytest fixture called mock_anthropic_message that returns a Message object. It takes a request parameter (type T). It sets default data_content to a JSON string with \"Claude says hi\". If request has a param attribute, it overrides data_content with request.param.get(\"data_content\", data_content). Then returns a Message with id, content (list with type text and text data_content), model, role, stop_reason, stop_sequence, type, usage (input_tokens=100, output_tokens=100). So the fixture is used to mock an Anthropic message for tests. It returns a Message object with default or overridden content.\n\nThus the summary: The code defines a pytest fixture that creates a mock Anthropic Message object, optionally customizing its content via request.param, and includes usage token counts. It is used in tests to simulate responses from the Claude model. The inputs: request fixture (pytest request) possibly containing param dict with \"data_content\". Output: a Message instance.\n\nWe need to follow the requirements: start directly with the summary content, no \"This code does...\" etc. Use Chinese (with English if needed). So we can write something like:\n\n\"提供一个 pytest fixture `mock_anthropic_message`，用于在单元测试中生成模拟的 Anthropic `Message` 对象。默认返回的 `content` 为 JSON 字符串 `{\\\"data\\\": \\\"Claude says hi\\\"}`，如果测试用例通过 `request.param` 传入 `data_content`，则使用该值覆盖默认内容。返回的 `Message` 包含固定的 `id`、`model`、`role`、`stop_reason`、`type`，以及 `Usage`（`input_tokens=100`, `output_tokens=100`）。该 fixture 的输入是 pytest 的 `request` 对象，输出是构造好的 `Message` 实例，供后续测试调用 Anthropic API 的函数使用。\"\n\nThat satisfies. No mention of \"This code does\". Use Chinese. Provide summary. Let's produce final answer.assistantfinal提供一个 pytest fixture `mock_anthropic_message`，用于在单元测试中生成模拟的 Anthropic `Message` 对象", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:48:51.746086"}