{"summary": "- This module defines utilities for handling context parameters in a function.\n- The `handle_context` function takes two optional dictionary arguments: `context` and `validation_context`.\n- It ensures that only one of these arguments is provided; if both are given, it raises a `ValueError`.\n- If `validation_context` is provided without `...` (the text is truncated).\"\n\nWe need to produce a summary of the functionality of the code. The code snippet includes imports and a function handle_context. The instruction: \"Start directly with the summary content. No 'This code does...' or 'Here is...'.\" So we need to start with the summary directly. Focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we can write Chinese description, maybe with some English terms. Provide summary of the code: It defines a function handle_context that processes context and validation_context arguments, ensures only one is provided, raises error if both, warns deprecation if validation_context used, returns context dict or None. Also imports many modules for other functionalities (retry, templating, etc.) but not used in snippet. So summary should mention that the module sets up utilities for handling context and validation context, includes type variables, imports for async/sync handling, logging, tenacity for retries, etc. Provide business logic: input: optional dicts, output: dict or None. Also mention deprecation warning.\n\nLet's produce Chinese summary. Ensure we start directly with summary content. No preamble. Let's do it.assistantfinal- 该模块主要提供 **上下文处理** 的工具函数，配合 OpenAI 异步/同步调用、重试、模板渲染等业务场景使用。  \n- **核心函数 `handle_context`**  \n  - **输入**：`context: dict[str, Any] | None`、`validation_context: dict[str, Any] | None`（均为可选的键值对字典）。  \n  - **业务规则**：  \n    1. 若同时传入 `context` 与 `validation_context`，抛出 `ValueError`，强制只能使用其中一个。  \n    2. 若仅传入已废弃的 `validation_context`，通过 `warnings.warn` 发出 `DeprecationWarning`，并将其视作 `context` 使用。  \n    3. 若两者均未提供，返回 `None`。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:42:46.327671"}