{"summary": "We have a code snippet from modin/polars/base.py. It defines a BasePolarsDataset class (presumably). It imports BaseQueryCompiler. It defines a method unique(self, subset=None, *, keep=\"any\", maintain_order: bool = False). The method returns a DataFrame with unique values in each column. It takes subset (columns to consider), keep (strategy to keep unique values), maintain_order (whether to maintain order). If keep is \"none\" or \"last\", it raises NotImplementedError. Otherwise, it returns a new instance of the class (via __constructor__) with a query_compiler that is the result of self._query_compiler.unique(subset=subset). So the method delegates to the underlying query compiler's unique method.\n\nThus the summary: The method unique extracts unique values per column, optionally limited to a subset of columns, with a keep strategy (only \"any\" supported), and returns a new DataFrame (BasePolarsDataset) containing those unique values. It does not support keep=\"none\" or \"last\". The maintain_order argument is ignored.\n\nNow produce the answer in Chinese.assistantanalysisWe need to output summary directly, no intro. Chinese. Should mention inputs: subset, keep, maintain_order. Output: DataFrame with unique values. Business logic: delegates to query compiler, raises NotImplementedError for unsupported keep. Use Chinese.assistantfinal该方法用于获取每列的唯一值，支持以下参数：  \n- **subset**：指定用于唯一性判断的列集合；若为 `None` 则对所有列进行处理。  \n- **keep**：唯一值保留策略，仅实现 `\"any\"`（默认），当取值为 `\"none\"` 或 `\"last\"` 时直接抛出 `NotImplementedError`，表示尚未支持。  \n- **maintain_order**：是否保持唯一值的原始顺序，当前实现未使用该参数。  \n\n业务逻辑上，方法将调用底层的 `_query_compiler.unique(subset=subset)` 完成唯一值计算，然后通过 `__constructor__` 包装返回一个新的 `BasePolarsDataset`（即 DataFrame）实例。输入为原始数据集对象及可选的列子集和保留策略，输出为仅包含唯一值的 DataFrame。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:00:57.103117"}