{"summary": "We need to summarize functionality of the code snippet. The snippet is from aiohttp/client_ws.py, defines ClientWebSocketResponse class? Actually snippet includes imports and a function _send_heartbeat. The function sends heartbeat ping frames, schedules pong timeout, handles early heartbeat, uses loop time, calculates timeout, cancels previous pong response callback, sets new callback, sends ping frame via writer, creates task, handles Python version differences, registers callback for task completion.\n\nWe need to summarize business logic, inputs, outputs. The function _send_heartbeat has no parameters besides self; uses internal state: self._loop, self._heartbeat_when, self._conn, self._pong_heartbeat, self._cancel_pong_response_cb, self._pong_response_cb, self._writer, self._ping_task, self._ping_task_done. It returns None.\n\nSo summary: This method is part of WebSocket client handling; it ensures periodic heartbeat (ping) is sent according to schedule, reschedules if early, sets up timeout for pong response, sends ping frame asynchronously, and registers callback to handle ping task completion.\n\nNow produce Chinese summary. Must start directly with summary content, no preamble. Provide business logic, inputs, outputs. Use Chinese (maybe include English terms). Let's craft.\n\nassistantfinal实现 WebSocket 客户端心跳机制的内部方法。  \n- **输入**：依赖对象的内部状态，包括事件循环 `self._loop`、下次心跳时间 `self._heartbeat_when`、连接对象 `self._conn`、心跳间隔 `self._pong_heartbeat`、WebSocket 写入器 `self._writer` 等。方法本身不接受外部参数。  \n- **业务逻辑**：  \n  1. 检查当前时间是否已到达预定的心跳发送时刻；若过早则重新在 `self._heartbeat_when` 时刻调度 `_send_heartbeat` 并返回。  \n  2. 根据连接的超时上限（`_timeout_ceil_threshold`）计算下一次期待收到 pong 的超时时间 `when`，并使用 `loop.call_at` 注册 `_pong_not_received` 回调，以在超时未收到 pong 时触发错误处理。  \n  3. 取消之前可能已注册的 pong 响应回调 `self._cancel_pong_response_cb()`，并保存新的回调句柄 `self._pong_response_cb`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:34:23.541920"}