{"summary": "The code defines a multipart handling module for aiohttp, providing classes and utilities to parse and construct multipart HTTP messages. It includes a MultipartReader class for reading multipart data from HTTP responses, a MultipartWriter for creating multipart payloads, and a BodyPartReader for reading individual parts. It also defines custom exceptions for handling malformed content disposition headers. The module imports various utilities and dependencies, such as base64, json, re, and various aiohttp components.\nThe user asks: \"Summarize the functionality of the following code. Requirements: 1. Start directly with the summary content. No 'This code does...' or 'Here is...' 2. Focus on the business logic, inputs, and outputs. 3. Use Chinese (e.g., Chinese/English).\"\n\nWe need to produce a summary in Chinese (maybe with some English terms) that directly starts with the summary content, no preamble. Should focus on business logic, inputs, outputs. The code snippet is part of aiohttp multipart handling. It defines imports, __all__, some classes, a classmethod from_response that constructs a MultipartResponseWrapper from a ClientResponse. The summary should describe that the module provides multipart parsing and writing for HTTP, handling multipart/form-data, etc. Input: HTTP response or request headers and content; output: multipart reader/writer objects, payloads, etc.\n\nWe need to start directly with the summary content. So start with something like:\n\n\"提供用于 aiohttp 的 multipart 消息解析与构造功能，核心类...\"\n\nMake sure not to start with \"This code does\". Use Chinese. Provide business logic: reading multipart from response, constructing multipart payloads, handling content disposition, etc. Mention inputs: HTTP response headers, content stream; outputs: MultipartReader, MultipartWriter, BodyPartReader, payload objects, etc.\n\nLet's craft a concise but thorough summary. Also mention custom exceptions.\n\nLet's produce final answer.assistantfinal提供 aiohttp 的 multipart 消息解析与构造功能。核心业务逻辑包括：\n\n- **MultipartReader**：接受 HTTP 响应的 `headers` 与 `content`（`StreamReader`），解析 `Content-Type: multipart/*` 的主体，按分隔符逐段读取并返回 `Payload` 对象、内容类型和内容编码的三元组 (`_Part`)。  \n  - **输入**：`ClientResponse` 的响应头和流式内容。  \n  - **输出**：可迭代的 `Body", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:50:03.876929"}