{"summary": "- Provides utility functions and classes for aiohttp library.\n- Includes basic authentication (BasicAuth), handling of HTTP headers, cookies, and ETag.\n- Implements a function `is_expected_content_type` to verify whether a response's content type matches the expected type, supporting JSON detection.\n- Defines constants for character sets, token definitions, and regex patterns used in HTTP parsing.\n- Handles environment variables and debugging settings.\n- Utilizes various Python standard libraries and third-party packages for asynchronous I/O, parsing, and data structures.\nThe user wants a summary of the functionality of the given code. They gave a snippet of aiohttp/helpers.py import statements and definitions. The summary should start directly with the content, no \"This code does...\" etc. Should focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a Chinese summary (maybe bilingual). Provide details: the code defines constants, regex, utility functions, classes like BasicAuth, ChainMapProxy, ETag, reify. The main business logic is is_expected_content_type function. Also defines environment handling, debugging flags, etc.\n\nWe need to follow requirement: start directly with summary content. No \"This code does...\" So start with something like \"提供 aiohttp 库的辅助工具，包括...\" etc.\n\nLet's craft a concise summary in Chinese, maybe with some English terms.\n\nAlso mention inputs and outputs: is_expected_content_type takes response_content_type and expected_content_type strings, returns bool.\n\nAlso mention BasicAuth class (though not shown in snippet but in __all__) but we can mention it.\n\nLet's produce final answer.assistantfinal提供 aiohttp 库的通用辅助工具，主要包括：\n\n- **常量与正则**：定义 HTTP 解析所需的字符集合、分隔符、Token 规则以及用于匹配 JSON 类型、ETag、Quoted‑ETag 等的正则表达式。  \n- **环境与调试控制**：读取 `AIOHTTP_NO_EXTENSIONS`、`PYTHONASYNCIODEBUG` 等环境变量，设置 `NO_EXTENSIONS`、`DEBUG` 标志，以决定是否加载扩展或开启调试模式。  \n- **核心函数 `is_expected_content_type`**  \n  - **输入**：`response_content_type: str`（服务器返回的 Content‑Type，未带参数），`expected_content_type: str`（业务期望的 MIME 类型）。  \n  - **输出**", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:40:10.936670"}