{"summary": "- The code defines a retry mechanism for handling OpenAI API calls with validation and usage tracking.\n- It imports necessary modules and defines generic type variables for type hinting.\n- The `initialize_usage` function creates a `CompletionUsage` object with zeroed token counts, or an `AnthropicUsage` object for specific modes.\n- The function returns the initialized usage object based on the mode.\n```\"\n\nWe need to produce a summary in Chinese (or Chinese/English). The user says: \"Requirements: 1. Start directly with the summary content. No \"This code does...\" or \"Here is...\". 2. Focus on the business logic, inputs, and outputs. 3. Use Chinese (e.g., Chinese/English).\"\n\nThus we need to output a summary directly, no preamble. Should be Chinese, maybe with some English terms. Should focus on business logic, inputs, outputs. So we need to summarize the functionality of the code snippet. The snippet includes imports, logger, type variables, and a function initialize_usage(mode: Mode) -> CompletionUsage | Any. The function creates a CompletionUsage object with zero token counts, and if mode is in {Mode.ANTHROPIC_TOOLS, Mode.ANTHROPIC_JSON}, it imports AnthropicUsage and returns that with zero tokens. So the business logic: initialize usage tracking based on mode.\n\nThus the summary: \"根据不同的模式（Mode），初始化并返回对应的使用量对象（CompletionUsage 或 AnthropicUsage），所有计数均设为0。输入是 Mode 枚举，输出是对应的使用量对象。\" Also mention that the code sets up retry logic, imports, type variables, but the snippet only includes initialize_usage. The summary should mention that the code defines generic types, imports, logger, and the function.\n\nThus produce a concise Chinese summary. No \"This code does...\" etc. Just start with summary. Possibly bullet points.\n\nLet's produce:\n\n- 根据传入的 Mode，创建并返回对应的使用量统计对象，默认使用 OpenAI 的 CompletionUsage，若模式为 Anthropic 相关则返回 AnthropicUsage。\n- 所有 token 计数初始化为 0，包括 completion、prompt、total 以及细分的 audio、reasoning、cached 等。\n- 输入：Mode 枚举值；输出：CompletionUsage 或 AnthropicUsage 实例，用于后续统计 API 调用的 token 使用情况。\n\nAdd mention of imports and type variables? The requirement:", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:38:59.355745"}