{"summary": "- The code defines a class `Image` (presumably) that represents an image resource, which can be initialized from a URL, file path, or base64-encoded data.\n- It validates the MIME type of the image against a whitelist list of valid MIME types (`VALID_MIME_TYPES`).\n- It provides a class method `from_raw_base64` that parses and decode a base64 string.\n- The method `from_... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... \nThe user wants a summary of the functionality of the code. The code snippet is incomplete but we can infer. The code defines a class Image (maybe using Pydantic BaseModel) with fields source, media_type, data. It includes a class method from_raw_base64 that decodes base64, checks image type using imghdr, validates MIME type against VALID_MIME_TYPES, returns an instance. It also imports many modules, defines type variables, etc. The summary should be in Chinese (with English optionally). Must start directly with summary content, no preamble. So produce a concise Chinese summary focusing on business logic, inputs, outputs. Mention that it validates MIME types, supports URL/file/base64, returns Image object. Also mention caching not needed. Provide details. Let's craft.assistantfinal该模块实现 **Image** 资源的统一封装与校验，核心业务逻辑如下：\n\n1. **输入来源**  \n   - `source`：接受三类输入之一  \n     - 网络 URL（如 `https://example.com/pic.jpg`）  \n     - 本地文件路径（`Path` 或字符串）  \n     - 直接的 Base64 编码字符串  \n   - `media_type`：必须显式提供的 MIME 类型，用于后续合法性检查。  \n   - `data`（可选）：若输入为 Base64，则在实例化时保存原始编码字符串（`repr=False` 防止日志泄露）。\n\n2. **MIME 类型白名单**  \n   - 仅允许 `image/jpeg、image/png、image/gif、image/webp` 四种类型（`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:37:08.935789"}