{"summary": "The code defines a unit test for a function `select_by_m2`? Actually `select_by_mz`. It uses `matchms` library. The test creates a Spectrum object with m/z values and intensities. It calls `select_by_mz(spectrum_in`), then asserts that the returned spectrum has 3 peaks (the lower half? Actually selects only the first half? Let's see: Input mz: [998, 999, ...\nThe test expects output mz: [998, 999, 1000] (first three). So select_by_mz likely selects peaks with m/z <= 1000? Or selects the first half of the array? The function may have default behavior: keep peaks with m/z <= 1000 (maybe default max_mz=1000). Indeed the test expects to keep up to 1000 inclusive. So the function filters out peaks above 1000.\n\nThus the summary: The test verifies that `select_by_mz` filters a spectrum to keep only peaks with m/z <= 1000 when no parameters are provided. It checks that the resulting spectrum has 3 peaks and that the m/z and intensity arrays match the expected values.\n\nNow produce summary in Chinese.\nWe need to produce summary content directly, no intro. Should be Chinese, maybe with some English terms. Provide business logic, inputs, outputs. Let's craft.\n\nThe code is a unit test. It creates a Spectrum with given mz and intensities arrays. Calls select_by_mz without parameters. The function defaults to keep peaks with mz <= 1000. The test asserts size 3, arrays equal.\n\nLet's produce final answer.assistantfinal创建一个包含 m/z 为 `[998, 999, 1000, 1001, 1002]`、对应强度 `[1, 10, 100, 1000, 10000]` 的 `Spectrum` 实例作为输入。调用 `select_by_mz`（未传入任何过滤参数），函数默认只保留 m/z ≤ 1000 的峰。返回的 `Spectrum` 应仅包含 3 个峰，m/z 为 `[998, 999, 1000]`，强度为 `[1, 10, 100]`，且两者长度相等。测试通过这些断言验证过滤逻辑的正确性。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:34:35.462023"}