{"summary": "We need to summarize the functionality of the code snippet. The snippet is from modin/polars/series.py. It imports modules, defines some variables, and defines a __matmul__ method for a Series class that raises NotImplementedError. The code is incomplete; it's just a placeholder.\n\nWe need to summarize business logic, inputs, outputs. The only method defined is __matmul__, which is supposed to perform matrix multiplication between two Series objects, but currently raises NotImplementedError.\n\nThus the summary: The module defines a Series class (presumably extending something) with a matrix multiplication operator overload that expects another Series and should return a Series representing the result, but it's not implemented yet.\n\nAlso there are some module-level variables: _sorted, _descending, flags, has_validity, has_nulls, rename, alias. They seem to be placeholders.\n\nThus the summary: The code sets up imports for Modin and Polars integration, defines some module-level flags, and provides a stub for matrix multiplication on Series objects.\n\nNow produce Chinese summary.assistantfinal该模块为 Modin 与 Polars 的 Series 类型做集成准备，导入了 `numpy`、`pandas`、`polars` 以及 Modin 内部的查询编译器、错误处理等组件，并声明了一些全局标识（如 `_sorted`、`_descending`、`flags`、`has_validity`、`has_nulls`、`rename`、`alias`），用于后续数据属性的管理。  \n\n核心业务逻辑在 `Series.__matmul__(self, other)` 方法中：  \n- **输入**：`other` 必须是另一个 `Series` 实例。  \n- **预期输出**：返回一个表示矩阵乘法结果的 `Series`。  \n- **当前实现**：直接抛出 `NotImplementedError(\"not yet\")`，表明矩阵乘法功能尚未实现，仅保留接口占位。  \n\n因此，该文件主要是为 Modin‑Polars 的 Series 类提供矩阵乘法运算符的占位实现，实际业务逻辑尚未完成。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:56:50.651637"}