{"summary": "We need to summarize the functionality of the code snippet. The code is from instructor/dsl/partial.py. It defines a class Partial (maybe a generic class) that inherits from something? Actually the snippet shows only a method __class_getitem__ defined inside a class Partial? The code snippet is incomplete but we can infer.\n\nThe __class_getitem__ method is a class method that allows using Partial[Model] syntax to create a new model class that inherits from PartialBase and the original model. It wraps nested BaseModel fields with Partial recursively, and optionally makes fields optional if a second argument MakeFieldsOptional is provided. It also handles generic types like List[User] by processing generic arguments.\n\nThe method returns a new Pydantic model class created via create_model, with name \"Partial{ModelName}\" and base classes (original model, PartialBase). It copies fields from the original model, optionally making them optional or wrapping them with Partial.\n\nThus the business logic: generate a \"partial\" version of a Pydantic model for use in partial updates, where fields can be omitted or nested models are also partial.\n\nInputs: wrapped_class (type of BaseModel) or tuple of (type, MakeFieldsOptional). Output: a new Pydantic model class.\n\nNow produce summary in Chinese/English. Must start directly with summary content, no preamble. Use Chinese. Provide business logic, inputs, outputs. Let's craft.\n\nassistantfinal生成 **Partial** 版 Pydantic 模型的工具函数  \n- **输入**：`wrapped_class` 可以是单个继承自 `BaseModel` 的类，或 `(ModelClass, MakeFieldsOptional)` 的二元组（后者指示在生成的模型中把所有字段都设为可选）。  \n- **处理过程**  \n  1. 通过 `__class_getitem__` 让 `Partial[Model]` 语法可用。  \n  2. 为每个字段创建拷贝 `tmp_field`，递归检查字段的类型注解：  \n     - 若是泛型（如 `List[User]`、`Dict[str, Item]`），提取其基类与参数，对每个参数递归调用 `_process_generic_arg`（内部实现）后重新构造泛型类型。  \n     - 若字段本身是 `BaseModel` 子类，则把注解替换为对应的 `Partial[SubModel]`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:57:45.795064"}