{"summary": "- The code defines a multipart handling module for aiohttp, providing classes and functions to read and write multipart HTTP bodies.\n- It imports various modules and dependencies.\n- The `readline` coroutine function reads a body part from the ```_`````_``_```` (the text) \nWe need to produce a summary of the functionality of the given code snippet. The snippet is from aiohttp/multipart.py, includes imports, __all__, and a coroutine function `readline`. The code defines a multipart handling module for aiohttp, providing classes and functions to read and write multipart HTTP bodies. It imports various modules and dependencies. The `readline` coroutine reads a body part line by line, handling boundaries and EOF detection.\n\nWe need to follow the requirements: start directly with the summary content, no \"This code does...\" or \"Here is...\". Focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we can write a Chinese summary, maybe mixing English terms. Provide description of what the code does: it's part of aiohttp multipart handling, defines classes like MultipartReader, MultipartWriter, BodyPartReader, parsing content disposition, handling boundaries, reading lines, etc. The `readline` function reads from a stream, returns bytes, handles boundaries, sets EOF flag, uses internal buffers.\n\nWe need to summarize the functionality of the code, not just the snippet but the whole file? The snippet includes imports and the `readline` function. The summary should mention that the module provides multipart parsing and writing, handling content disposition, encoding, compression, etc. The business logic: reading multipart HTTP bodies, parsing headers, handling boundaries, decompressing, etc. Input: a stream of bytes representing multipart content, boundary string. Output: lines of content, detection of end-of-part, raising errors if needed.\n\nWe need to produce a concise summary. Let's do it.\n\nWe must not start with \"This code does...\" but directly with the summary. So start with something like: \"提供 aiohttp 的 multipart 处理功能，...\" etc.\n\nLet's write in Chinese, with some English terms. Ensure we mention inputs and outputs. Use bullet points? Could be okay.\n\nLet's produce final answer.assistantfinal提供 aiohttp 的 multipart 处理功能，核心业务逻辑包括：\n\n- **模块职责**：解析和生成 HTTP multipart 请求/响应体，支持文件上传、表单数据以及压缩/解码等", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:49:01.876300"}