{"summary": "We have a code snippet from aiohttp/multipart.py. It defines imports and sets up classes and functions for handling multipart HTTP requests and responses. It includes a function fetch_next_part that returns a ****...**...**.\n\nWe need to summarize the functionality of the code. The code snippet includes imports, __all__, and a function fetch_next_part. The function fetch_next part is an async function that reads headers and returns a part reader.\n\nThus, the summary should be: The code defines a multipart handling module for aiohttp.\n\nWe need to follow the requirements: start directly with the summary content. No \"This code ...\". Focus on business logic, inputs, outputs.\n\nThus, Provide a concise summary.\n\nWe need to mention that it imports many modules, defines __all__, sets up classes, and defines fetch_next_part.\n\nThus, answer: \"aiohttp multipart handling: reads next part's headers, returns a BodyPartReader or MultipartReader.\"\n\nWe need to mention that fetch_next_part is async, reads headers via _read_headers, then returns a part reader based on headers.\n\nThus, answer: \"Handles multipart HTTP request parsing, reading next part's headers and returning appropriate reader.\"\n\nWe can also mention that the code defines classes like MultipartReader, MultipartWriter, BodyPartReader, and functions for parsing content disposition, etc.\n\nThus, answer: \"Provides multipart parsing and writing utilities for aiohttp, including reading next part's headers and returning a part reader.\"\n\nWe need to follow the requirement: start directly with the summary content. No \"This code does...\". So just start with \"aiohttp multipart handling module...\"\n\nThus, answer: \"aiohttp multipart handling module...\"\n\nNow produce final answer.assistantfinalaiohttp multipart 处理模块，提供 MultipartReader、MultipartWriter、BodyPartReader 等类以及解析 Content‑Disposition、MIME 类型等工具函数。核心业务逻辑在 `fetch_next_part`：异步读取当前 multipart 流的头部信息（通过内部 `_read_headers`），根据解析得到的头部创建并返回相应的分段读取器（`BodyPartReader` 或嵌套的 `MultipartReader`），供上层业务逐段读取文件、表单字段或嵌套 multipart 内容。输入为当前流的字节数据，输出为对应的分段读取对象。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:50:20.088873"}