{"summary": "- The code defines a client-side WebSocket implementation using aiohttp library.\n- It imports various modules and functions.\n- It defines a default timeout configuration for the WebSocket.\n- It defines an asynchronous function `__anasync__` that receives a message.\n```\n\n\nWe need to produce a summary of the functionality of the code snippet. The snippet is incomplete; it's part of aiohttp/client_ws.py. It includes imports, default timeout, and an async __anext__ method that receives a message and raises StopAsyncIteration on close messages. The request: \"Summarize the functionality of the following code. Requirements: 1. Start directly with the summary content. No 'This code does...' or 'Here is...' 2. Focus on the business logic, inputs, and outputs. 3. Use Chinese (e.g., Chinese/English).\"\n\nThus we need to produce a Chinese summary (maybe with some English terms). Should mention that it's a client WebSocket response class, handling receiving messages, default timeout, etc. Should mention inputs: WebSocket messages, outputs: WSMessage objects, raising StopAsyncIteration on close.\n\nLet's produce a concise Chinese summary. Ensure we start directly with the summary content, no preamble. Use Chinese. Possibly include English terms like WSMessage, WSMsgType.\n\nLet's write:\n\n\"实现 aiohttp 客户端 WebSocket 响应的核心逻辑，提供默认超时配置 `DEFAULT_WS_CLIENT_TIMEOUT`（接收超时无限制，关闭超时 10 秒），并实现异步迭代协议 `__anext__`：调用 `self.receive()` 获取下一条 WebSocket 消息 `msg`，若 `msg.type` 为 CLOSE、CLOSING 或 CLOSED，则抛出 `StopAsyncIteration` 结束迭代，否则返回 `WSMessage` 对象。\"\n\nAdd mention of imports and error handling? The snippet includes many imports, but the core business logic is the __anext__ method.\n\nThus final answer.assistantfinal实现 aiohttp 客户端 WebSocket 响应的核心业务逻辑。  \n- 定义默认的 WebSocket 超时配置 `DEFAULT_WS_CLIENT_TIMEOUT`，其中接收超时为 `None`（无限制），关闭超时为 10 秒。  \n- 实现异步迭代协议 `__anext__`：调用 `self.receive()` 异步获取下一条 WebSocket 消息 `msg`，如果 `msg", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:36:04.581555"}