{"summary": "The code defines a TraceConfig class in the aiohttp/tracing.py module. It imports necessary modules and defines a list of exported symbols. The class includes a property called \"on_response_chunk_received\" which returns a Signal object. This Signal object is used to handle the event of receiving a response chunk.\nThe user wants a summary of the functionality of the code. They gave a snippet of code from aiohttp/tracing.py. The code includes imports, __all__ list, a generic type variable, and a property definition for on_response_chunk_received returning a Signal. The summary should focus on business logic, inputs, outputs, in Chinese (or Chinese/English). Should start directly with the summary content, no \"This code does...\" etc. So we need to produce a concise summary in Chinese, maybe with some English terms. Should mention that TraceConfig is used for tracing events in aiohttp client, allowing users to attach callbacks to various request lifecycle events, such as request start, end, exception, connection events, DNS resolution, redirects, chunk sent/received, etc. The property on_response_chunk_received returns a Signal that can be used to register callbacks that receive TraceResponseChunkReceivedParams when a response chunk is received. The inputs are the callbacks; the output is the Signal object. The business logic is to provide a tracing configuration for aiohttp client requests.\n\nLet's produce a summary in Chinese, maybe with some English terms. Ensure we start directly with the summary content. No \"This code does...\". So start with something like:\n\n\"提供 aiohttp 客户端请求的追踪配置（TraceConfig），...\"\n\nLet's do that.assistantfinal提供 aiohttp 客户端请求的追踪配置（`TraceConfig`），用于在请求生命周期的各个关键节点挂载自定义回调。  \n- **输入**：用户通过 `TraceConfig` 实例的属性（如 `on_response_chunk_received`）注册回调函数，这些回调遵循 `Signal[_SignalCallback[TraceResponseChunkReceivedParams]]` 的签名，接收包含响应块信息的参数对象。  \n- **业务逻辑**：`TraceConfig` 维护一组 `Signal` 对象，每个 `Signal` 对应一种追踪事件（请求开始、结束、异常、连接创建、DNS 解析、重定向、请求/响应块发送/接收等）。当对应事件在 aiohttp 客户端内部触发时，`Signal` 会依", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:37:20.131030"}