{"summary": "The code defines a module for handling ZIP files, providing classes and functions for reading, writing, and manipulating ZIP archives. It includes constants for ZIP compression methods, version numbers, and limits. The module defines structures for parsing the End of Central Directory (EOCD) record, central directory entries, and local file headers. It also defines a function `_EndRecData` that reads the EOCD record from a file-like object, handling both cases where the archive has no comment and where it has a comment up to 64KB. The function returns a list of the EOCD fields and the file offset of the record.\nWe need to produce summary content directly, no intro phrase. Should be Chinese (maybe mixed). Provide business logic, inputs, outputs. So summarizing functionality: module for zip handling, constants, parsing structures, function _EndRecData reads EOCD record from file-like object, returns list of fields plus offset, handles comment, Zip64. Provide inputs: file pointer, output: list or None. Also mention other parts: imports, __all__, etc. Provide business logic: reading zip file metadata, etc. Let's craft.assistantfinal提供 ZIP 文件的底层解析与操作功能。  \n- **常量与结构**：定义压缩方式（`ZIP_STORED`, `ZIP_DEFLATED`, `ZIP_BZIP2`, `ZIP_LZMA` 等）、版本号、大小限制以及用于解析 ZIP 结构的 `struct` 格式（EOCD、中央目录、文件头、ZIP64 记录）。  \n- **核心函数 `_EndRecData(fpin)`**  \n  - **输入**：一个支持 `seek`、`tell`、`read` 的文件对象 `fpin`（通常是打开的 ZIP 文件）。  \n  - **处理逻辑**：  \n    1. 通过 `seek(0,2)` 获取文件总大小。  \n    2. 先尝试在文件尾部直接读取固定长度的 EOEO（End of Central Directory）记录，判断是否无注释且签名为 `PK\\005\\006`。  \n    3. 若未匹配，则在文件末端向前最多 64 KB（ZIP 注释最大长度）搜索 EOEO 签名，找到后解析记录并读取对应的注释字段。  \n    4. 解析得到的字段通过 `struct.unpack` 转为列表，并在末尾追加", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:01:51.637271"}