{"summary": "- This module provides utilities for handling multipart HTTP requests/responses in aiohttp.\n- It defines classes for reading and writing multipart bodies, including `MultipartReader`, `MultipartWriter`, and `BodyPartReader`.\n- The `_read_chunk` function reads a chunk of data from a stream, handling the detection of the multipart boundary.\n- It ensures that the chunk size is at least the length of the boundary.\n- It reads the first chunk from the `content` stream.\n- It iterates through the parts of the input stream.\n...\nThe user wants a summary of the functionality of the given code. The requirements: start directly with the summary content, no \"This code does...\" or \"Here is...\". Focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a Chinese summary (maybe with some English terms). The code snippet is from aiohttp/multipart.py, includes imports, defines __all__, defines a function _read_chunk_from_stream (actually it's defined as async def _read_chunk_from_stream(self, size: int) -> bytes:). The code includes reading chunks from a stream, handling multipart boundaries, ensuring chunk size >= boundary length, reading first chunk, handling previous chunk, detecting boundary, unread data, etc.\n\nWe need to summarize the functionality: The module provides multipart handling, reading/writing multipart bodies, parsing content disposition, etc. The specific function reads a chunk from a stream, handling unknown length parts, detecting boundaries, managing previous chunk, handling EOF, returning the previous chunk as result.\n\nWe need to mention inputs: self (BodyPartReader), size (int). Output: bytes (the chunk). Business logic: reading from content stream, detecting boundary, handling unread data, warnings, etc.\n\nWe need to produce a Chinese summary. Let's do that.\n\nWe must not start with \"This code does...\" or \"Here is...\". So start directly with the summary content.\n\nLet's produce a concise Chinese summary, maybe with some English terms.\n\nOk.assistantfinal提供 aiohttp 中 multipart 请求/响应的完整处理能力，核心包括：\n\n- **业务入口**：`MultipartReader`、`MultipartWriter`、`BodyPartReader` 三大类，分别负责解析、生成以及逐段读取 multipart 消息体。  \n- **输入**：`BodyPartReader._read_chunk_from_stream(self, size: int)` 接收目标读取的字节数 `size`（必须不小于 multipart 边", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:48:57.836561"}