{"summary": "- The code defines a function `llm_validator` that creates a validator using a language model (LLM) to validate an attribute.\n- The validator takes a string input (value) and returns a string.\n- The validator uses the `client` (an instance of `Instructor` class) to generate a response from the LLM.\n- The response is a `Validator` model.\n- The validation is based on the statement (the ````). \nWe need to produce a summary in Chinese (or Chinese/English). Must start directly with the summary content, no preamble. Should focus on business logic, inputs, outputs. Provide concise description.\n\nWe need to analyze the code: It's a function `llm_validator` that returns a callable validator function for Pydantic field validation. It uses an Instructor client to call OpenAI chat completions with a system prompt and user prompt containing the statement and the value. It expects a response model `Validator` (not defined in snippet). It asserts that response.is_valid is True, else raises AssertionError with reason. If allow_override and response not valid and fixed_value present, returns fixed_value; else returns original value.\n\nInputs: statement (string), client (Instructor), allow_override (bool), model (string), temperature (float). Output: a callable that takes a string v and returns a string (original or fixed value). The validator raises AssertionError if invalid and not overridden.\n\nAlso mention usage with Pydantic field validator.\n\nLet's craft summary.\n\nWe need to start directly with summary content. Provide Chinese description.\n\nLet's produce:\n\n\"该模块提供 `llm_validator` 函数，用于生成基于 LLM 的属性校验器。...\"\n\nMake sure to include business logic, inputs, outputs.\n\nLet's write.\n\nassistantfinal该模块提供 `llm_validator`，用于生成基于大语言模型（LLM）的属性校验函数，常配合 Pydantic 的 `field_validator` 使用。  \n\n**业务逻辑**  \n1. 接收校验规则描述 `statement`（字符串）以及已初始化的 `Instructor` 客户端 `client`。  \n2. 返回一个内部函数 `llm(v: str) -> str`，在每次字段赋值时被调用。  \n3. `llm` 向 LLM 发送两条消息：  \n   - system 提示：模型是“世界级验证模型”，需要判断给定值是否符合 `statement`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:58:50.969878"}