{"summary": "We need to summarize the functionality of the code snippet. The snippet is from aiohttp/payload.py. It imports many modules, defines constants, types, and a registry for payload handling. It defines a function get_payload that returns a Payload instance from the registry based on data. The code defines __all__ list of exported symbols. It defines a constant TOO_LARGE_BYTES_BODY = 2**20 (1 MB). It defines a type alias PayloadType = Type[\"Payload\"] and a tuple type for registry items. It creates a PAYLOAD_REGISTRY = PayloadRegistry() (presumably defined elsewhere). The get_payload function uses the registry to get a payload object for given data.\n\nThus the business logic: It provides a payload handling system for aiohttp, mapping various data types to appropriate Payload subclasses (BytesPayload, StringPayload, etc.) and exposing a get_payload factory function. The inputs: data (any type) plus optional args/kwargs; output: a Payload instance appropriate for the data type. The code also defines constants and type hints.\n\nWe need to produce a summary in Chinese (or Chinese/English). Must start directly with the summary content, no preamble. So we output something like:\n\n\"提供 aiohttp 的 Payload 机制，维护一个 PAYLOAD_REGISTRY 用于根据不同的数据类型自动匹配相应的 Payload 子类（如 BytesPayload、StringPayload、JsonPayload 等），并通过 get_payload(data, *args, **kwargs) 工厂函数返回对应的 Payload 实例。输入为任意数据对象及可选参数，输出为实现 AbstractStreamWriter 接口的 Payload 对象。还定义了 1 MB 的 TOO_LARGE_BYTES_BODY 常量、__all__ 导出列表以及类型别名等辅助结构。\"\n\nThat satisfies.assistantfinal提供 aiohttp 的 Payload 机制，维护一个全局的 `PAYLOAD_REGISTRY` 用于根据不同的数据类型自动匹配相应的 `Payload` 子类（如 `BytesPayload`、`StringPayload`、`JsonPayload`、`IOBasePayload` 等），并通过 `get_payload(data, *args, **kwargs)` 工厂函数返回对应的 `Payload` 实例。  \n\n- **输入**：任意对象 `data`（以及可选的 `*args`、`**kwargs`），用于决定使用哪种具体的 Payload 实现。  \n- **输出**：实现 `AbstractStreamWriter` 接口的 `Payload", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:09.032970"}