{"summary": "- The code defines a payload handling module for aiohttp, providing various payload classes (BytesPayload, StringPayload, etc.) and a registry for mapping data types to payload implementations.\n- It includes constants like TOO_LARGE_BYTES_BODY (1 MB) and default content type.\n- The Payload base class defines methods for preparing and sending data, handling content type, length, and encoding.\n- Payload subclasses implement specific handling for different data types (bytes, strings, file-like objects, JSON, async iterables).\n- The module also provides utility functions to get a payload instance based on the input data and to register/unregister etc.\nWe need to produce a summary in Chinese (or Chinese/English). Must start directly with the summary content, no preamble. Should focus on business logic, inputs, outputs. Provide concise description.\n\nThe code snippet is only part of file; but we can infer overall functionality. Provide summary: defines payload handling for aiohttp, registry, constants, base class, etc. Input: data to be sent in HTTP request/response; output: Payload object that can be streamed to writer, with content-type, length, encoding.\n\nLet's craft final answer.assistantfinal实现 **aiohttp** 请求/响应体的统一封装与发送。  \n\n- **核心对象**：`Payload` 抽象基类及其子类（`BytesPayload、StringPayload、IOBasePayload、BytesIOPayload、BufferedReaderPayload、TextIOPayload、StringIOPayload、JsonPayload、AsyncIterablePayload`），负责把任意 Python 对象转换为可流式写入 `AbstractStreamWriter` 的二进制数据。  \n- **注册表**：`PAYLOAD_REGISTRY`（`PayloadRegistry`）维护 **数据类型 → Payload 子类** 的映射，`payload_type` 与 `get_payload` 根据输入对象的类型自动返回对应的 `Payload` 实例。  \n- **常量**：  \n  - `TOO_LARGE_BYTES_BODY = 2**20`（1 MB）用于判断大块字节体是否需要特殊处理。  \n  - `_default_content_type = \"application/octet-stream\"` 作为未指定时的默认 `Content-Type`。  \n- **业务流程**：  \n  1. **输入**：任意对象（bytes、str、file‑like、JSON‑serializable、async iterable 等）以及可选的 `content_type`、`charset`、`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:52.724992"}