{"summary": "We need to summarize the functionality of the code snippet. The code is part of aiohttp client library, specifically the _ws_connect method of ClientSession class. It handles establishing a WebSocket connection. It takes many parameters: url, method, protocols, timeout, receive_timeout, autoclose, autoping, heartbeat, auth, origin, params, headers, proxy, proxy_auth, ssl, server_hostname, proxy_headers, compress, max_msg_size. It constructs headers for WebSocket handshake, generates Sec-WebSocket-Key, optionally adds protocols, origin, extensions for compression. It validates SSL param type. Then it sends an HTTP request using self.request with read_until_eof=False. It checks response status 101 and required headers Upgrade: websocket, Connection: Upgrade. It validates Sec-WebSocket-Accept matches expected SHA1 of key+WS_KEY. It selects protocol if server responded with one of requested protocols. It parses compression extensions. It configures connection read timeout based on ws_timeout.ws_receive. It creates WebSocketDataQueue, sets parser to WebSocketReader, creates WebSocketWriter with mask, compression, notakeover. If any error occurs, closes response and re-raises. Finally returns a ClientWebSocketResponse instance with the created reader, writer, protocol, response, timeout, autoclose, autoping, loop, heartbeat, compress, client_notakeover.\n\nThus summary: business logic: establishing WebSocket handshake, handling timeouts, compression, authentication, proxies, SSL, returning a WebSocket response object.\n\nNow produce Chinese summary. Must start directly with summary content, no \"This code does...\" etc. So start with something like \"实现 WebSocket 连接的握手与初始化，...\" Provide inputs and outputs. Use Chinese. Provide business logic. Let's craft.\n\nassistantfinal实现 WebSocket 连接的完整握手与初始化流程。  \n**输入**：  \n- `url`（目标地址）以及可选的 `method`（默认 GET）  \n- `protocols`（客户端期望的子协议列表）  \n- `timeout` / `receive_timeout`（连接、关闭、接收超时）  \n- `autoclose`、`autoping`、`heartbeat`（自动关闭、自动 ping、心跳间隔）  \n- `auth`、`origin`、`params`、`headers`（HTTP 认证、Origin、查询参数、额外请求头）  \n- `proxy`、`proxy_auth`、", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:45:42.151745"}