{"summary": "The code defines a module for handling wave audio files. It imports necessary modules and defines constants for wave format types. It also defines a named tuple `_wave_params` to store wave file parameters such as channels, sample width, etc. The `tell` function returns the current read position (size_read) in the wave file. It also checks whether the file is closed.\nThe user wants a summary of the functionality of the code, focusing on business logic, inputs, outputs, in Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" or \"Here is...\". So we need to produce a concise summary in Chinese, maybe with some English terms. Should mention that it's a wave file handling module, defines constants, namedtuple for parameters, a tell method that returns current read position, checks closed file. Also mention that __all__ includes open, Error, Wave_read, Wave_write. Provide business logic: reading/writing wave files, handling PCM format, etc. Provide inputs: wave file object, etc. Output: current position.\n\nLet's craft a paragraph in Chinese, maybe with bullet points? The requirement: \"Start directly with the summary content.\" So we should not have any preamble. Just start with the summary. Could be a paragraph or bullet list. Let's produce a concise summary.\n\nWe need to mention that the code defines constants for PCM and extensible formats, defines a GUID for PCM subtype, defines array format mapping, defines a namedtuple for wave parameters, defines a tell method that raises error if file closed and returns size_read. Also __all__ defines exported symbols.\n\nLet's produce final answer.assistantfinal- 该模块实现了对 **WAV 音频文件** 的基本读写封装，提供 `open`, `Error`, `Wave_read`, `Wave_write` 四个公开接口（通过 `__all__` 导出）。  \n- 常量 `WAVE_FORMAT_PCM`、`WAVE_FORMAT_EXTENSIBLE` 与 `KSDATAFORMAT_SUBTYPE_PCM` 用于标识 PCM 编码及其扩展格式，供后续解析/写入时匹配文件头的 `fmt` 块。  \n- `_array_fmts` 保存不同采样宽度对应的 Python `array` 类型码（如 `'b'`、`'h'`、`'i'`），用于在读取原始样本数据时快速转换为数值数组。  \n- `_", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:50:21.814110"}