{"summary": "We need to summarize functionality of the code snippet. The snippet is from instructor/dsl/partial.py. It imports many modules, defines a class Partial? Actually snippet shows only __new__ method of class Partial? The code snippet includes imports and a __new__ method that raises TypeError to prevent direct instantiation. So the class Partial is abstract generic for BaseModel. The code likely defines a DSL for partial model updates? But only snippet given. Summarize: The file defines a generic abstract class Partial[T_Model] that inherits from BaseModel? Not shown. The __new__ method prevents direct instantiation, raising TypeError. The class is used as a marker for partial updates of Pydantic models, used by instructor library. Input: attempts to instantiate Partial; output: TypeError. Business logic: enforce abstract nature.\n\nThus summary: The code defines a generic abstract class Partial that cannot be instantiated directly; it raises TypeError on __new__. It imports utilities for JSON extraction, Pydantic model creation, async generators, etc., indicating that Partial is used in a DSL for handling partial data extraction from streams, possibly for incremental model building. The class is generic over a Pydantic BaseModel subclass.\n\nProvide Chinese summary. Let's craft.\n\nassistantfinal该文件实现了 **Partial** 抽象基类，用于在 *instructor* DSL 中表示“部分” Pydantic 模型（即只提供模型字段的子集）。  \n\n- **业务逻辑**  \n  - `Partial` 被声明为 `Generic[T_Model]`，其中 `T_Model` 必须是 `pydantic.BaseModel` 的子类。  \n  - 通过重写 `__new__`，在任何直接实例化 `Partial` 时立即抛出 `TypeError(\"Cannot instantiate abstract Partial class.\")`，从而强制用户只能通过子类或工厂函数生成具体的部分模型实例。  \n  - 该类本身不实现任何字段或方法，仅充当类型标记和约束机制，配合后续的 DSL 解析、流式 JSON 抽取（`extract_json_from_stream` / `extract_json_from_stream_async`）以及动态模型创建（`create_model`）使用。\n\n- **输入**  \n  - 任意对 `Partial`（或其子类）进行实例化的调用，例如 `Partial[MyModel]()`。\n\n- **输出**  \n  - 立即触", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:57:37.560762"}