{"summary": "The code defines a function ``map_to_gjson`......... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... \nWe need to produce a summary in Chinese (or Chinese/English). The code is from instructor/utils.py. It imports many modules, defines logger, type variables, etc. The main function defined is map_to_gemini_function_schema which maps an OpenAPI schema dict to a Gemini function call schema. It uses jsonref to resolve $ref references, defines a Pydantic BaseModel subclass FunctionSchema with fields like description, enum, example, format, nullable, items, required, type, properties. It then resolves references, removes $defs, recursively adds \"format\": \"enum\" for any enum fields, then creates a FunctionSchema instance from the dict and returns its dict representation excluding None/unset fields.\n\nThus the business logic: input is a dict representing an OpenAPI schema (possibly with $ref). Output is a dict representing a Gemini function schema, with enum fields annotated with format \"enum\". It uses jsonref to resolve references, and Pydantic for validation and serialization.\n\nAlso there are other imports and type definitions but not used in this snippet. The function is the core.\n\nThus summary: The function transforms OpenAPI schema to Gemini function schema, handling $ref resolution, enum formatting, and returns a cleaned dict.\n\nWe need to start directly with the summary content, no preamble. Use Chinese. Provide business logic, inputs, outputs.\n\nLet's produce.assistantfinal将 OpenAPI JSON‑Schema（可能包含 `$ref` 引用）转换为 Google Gemini 函数调用所需的 schema。  \n**输入**：`obj: dict[str, Any]` —— 一个符合 OpenAPI 规范的 schema 对象。  \n**处理流程**  \n1. 使用 `jsonref.replace_refs` 递归展开所有 `$ref`，得到完整的 JSON‑Schema 并去除 `$defs`。  \n2. 递归遍历得到的字典，若键为 `enum`，在同层加入 `\"format\": \"enum\"`，以满足 Gemini 对枚举的格式要求。  \n3. 定义内部 Pydantic 模型 `FunctionSchema`，字段覆盖 OpenAPI 中常见属性（`type、description、enum、items、properties、required` 等），并通过 `FunctionSchema(**schema)` 对展开后的 schema 进行结构校验。  \n4. 调用 `", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:40:23.257328"}