{"summary": "We need to summarize the functionality of the code snippet. The code is from Lib/wave.py, defines Wave_read class, open, Error, etc. The snippet includes imports, constants, namedtuple for wave parameters, and the initfp method of Wave_read class. The method reads a wave file header, validates RIFF and WAVE identifiers, parses fmt and data chunks, sets up internal state for reading audio frames. It raises errors if missing or out-of-order chunks. The method sets attributes like _convert, _soundpos, _file, _fmt_chunk_read, _data_chunk, _nframes, etc. It uses _Chunk class (not shown) to read chunks. The output is a Wave_read object ready to read audio data. So we need to produce a Chinese summary focusing on business logic, inputs, outputs. Provide no \"This code does...\" etc. Just start with summary content. Let's produce a concise Chinese description.\n\nLet's include: Input: file-like object representing a wave file. Output: internal state of Wave_read object configured for reading audio frames; raises Error on invalid format. Business logic: verify RIFF header, WAVE format, locate fmt chunk, parse format, locate data chunk, compute number of frames, set conversion function, etc.\n\nLet's produce final answer.assistantfinal读取并解析 WAV 文件头部，完成以下业务流程：\n\n1. **输入**：一个支持 `read`、`seek` 等文件操作的二进制流（`file`），必须是 RIFF/WAVE 格式的音频文件。  \n2. **初始化**：  \n   - `_convert` 设为 `None`（后续根据采样宽度决定是否需要字节序转换）。  \n   - `_soundpos` 设为 0，记录当前读取的帧位置。  \n   - 使用内部 `_Chunk` 类包装文件对象，确保以小端序读取。  \n3. **文件标识校验**：  \n   - 首 4 字节必须为 `b'RIFF'`，否则抛 `Error('file does not start with RIFF id')`。  \n   - 接下来 4 字节必须为 `b'WAVE'`，否则抛 `Error('not a WAVE file')`。  \n4. **遍历 Chunk**：循环读取后续块，直至文件结束：  \n   - 若块名为 `b'fmt '`，调用", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:50:34.206363"}