{"summary": "The provided code defines a function ``extract`... (... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... \nThe ... ... ... ......\nWe need to summarize the functionality of the code. The code snippet includes imports, logger, type variables, and a function extract_messages. The code is from instructor/retry.py. It imports many modules: logging, JSONDecodeError, typing, InstructorRetryException, Hooks, Mode, handle_reask_kwargs, process_response, process_response_async, update_total_usage, AsyncValidationError, ChatCompletion, CompletionUsage, CompletionTokensDetails, PromptTokensDetails, BaseModel, ValidationError, tenacity (AsyncRetrying, RetryError, Retrying, stop_after_attempt), ParamSpec.\n\nThen defines logger, type variables: T_Model bound to BaseModel, T_Retval, T_ParamSpec, T.\n\nThen defines extract_messages function: extracts messages from kwargs, handling cohere and gemini chat history cases. It returns kwargs.get(\"messages\", kwargs.get(\"contents\", kwargs.get(\"chat_history\", []))).\n\nThus the code is part of a retry mechanism for instructor library. It likely includes functions for retrying API calls, handling re-asks, processing responses, updating usage, validation errors, etc. But only the extract_messages function is shown. The summary should focus on business logic, inputs, outputs. So we need to describe that the function extracts chat messages from various possible keys in kwargs, returning a list or whatever.\n\nThus the summary: The code sets up a retry infrastructure for OpenAI chat/completion calls, defines type variables, logger, and provides a utility function extract_messages that takes a dict of kwargs and returns the chat messages, checking keys \"messages\", \"contents\", \"chat_history\". It supports different providers (Cohere, Gemini). The function returns the extracted messages (list or other). The rest of the file likely contains retry logic using tenacity, handling exceptions, processing responses, updating usage, etc.\n\nWe need to summarize the functionality of the code snippet. The snippet includes imports and the extract_messages function. So the summary: It defines a helper to extract chat messages from kwargs, handling multiple possible key names.\n\nThus", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:39:03.482855"}