{"summary": "We need to summarize the functionality of the code snippet. The code is from instructor/dsl/partial.py PartialBase. It imports many modules. It defines a generic type variable T_Model bound to BaseModel. Then defines a class method get_partial_model with @cache decorator. It asserts that the class is subclass of BaseModel. It constructs a model name: if class name starts with \"Partial\", keep it; else prefix \"Partial\". Then returns a new Pydantic model created via create_model, with base class __base__=cls, module same as cls, and for each field in cls.model_fields, it makes the field optional via _make_field_optional (function not shown). So the purpose is to generate a \"partial\" version of a Pydantic model where all fields become optional, for validating partial results.\n\nThus summary: The code defines a mixin (PartialBase) that can be used to generate a partial version of any Pydantic BaseModel subclass, making all fields optional, cached for reuse. Input: a subclass of BaseModel; output: a new Pydantic model class with same fields optional.\n\nWe need to output in Chinese (maybe with English terms). Provide summary directly. No preamble. Let's produce.assistantfinal生成并缓存“Partial”模型的工具类。  \n- **业务逻辑**：在任意继承自 `pydantic.BaseModel` 的类上调用 `get_partial_model`，会动态创建一个新的 Pydantic 模型，该模型以原类为基类，但把所有字段都转换为可选（`Optional[...]`），从而用于验证只包含部分字段的输入或返回值。  \n- **输入**：调用该类方法的类本身（必须是 `BaseModel` 子类）。  \n- **输出**：返回一个新建的模型类型，名称为原类名或在其前加前缀 `Partial`，并保留原模块路径。创建过程使用 `pydantic.create_model`，字段可选化通过内部 `_make_field_optional` 实现。  \n- **缓存**：使用 `functools.cache`，同一原模型只会生成一次 Partial 模型，提升重复调用的性能。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:57:01.249902"}