{"summary": "- Function `retry_sync` implements a retry mechanism for synchronous functions, handling validation and parsing errors.\n- Input parameters include the target function `func`, optional response model `response_model`, arguments `args` and `kwargs`, optional context, retry configuration `max_retries`, strict mode flag `strict`, operation mode `mode`, and optional hooks for event emission.\n- It initializes usage tracking and retry settings, then attempts to execute `func` within a retry loop.\n- On each attempt, it logs the attempt, emits completion arguments via hooks, calls `func`, emits the response, updates usage stats, and processes the response using `process_response`.\n- If a `ValidationError` or `JSONDecodeError` occurs, it logs the parse error, emits a parse error event, adjusts kwargs for re-asking (using `handle_reask_kwargs`), and raises the exception to trigger a retry.\n- If all retries fail, it raises `InstructorRetryException` with details about the last exception, the last response, attempt count, and usage statistics.\n- Output: Returns a validated and processed response model instance or None if no model is provided.\nThe user wants a summary of the functionality of the code, focusing on business logic, inputs, outputs, in Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" or \"Here is...\". So we need to produce a concise summary in Chinese, maybe with some English terms. Should mention that it's a retry mechanism for synchronous functions, handling validation errors, usage tracking, hooks, etc. Provide inputs and outputs. Should be in Chinese. Let's craft.\n\nWe need to ensure we follow requirement: start directly with the summary content. So no preamble. Provide summary.\n\nLet's produce.assistantfinal实现对同步函数的自动重试并在成功后返回经过模型校验的结果。  \n\n**核心业务逻辑**  \n1. **初始化**  \n   - 根据 `mode` 创建累计 token 使用统计 (`total_usage`)。  \n   - 将 `max_retries` 转换为 `tenacity.Retrying` 实例（同步版）。  \n   - 若未提供 `hooks`，使用默认 `Hooks` 对象。  \n\n2. **重试循环**（`for attempt in max_retries`）  \n   - 记录当前尝试次数并通过 `hooks.emit_completion_arguments` 把调用参数广播。  \n   - 调用目标函数 `func(*args, **", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:39:07.734087"}