{"summary": "- The code defines a `data_received` method for handling incoming data in an aiohttp client protocol.\n- It processes the data:\n  - Reschedules the timeout.\n  - If the data is empty, returns.\n  - If a custom payload (i.e., `````) \nWe need to produce a summary in Chinese (or Chinese/English) focusing on business logic, inputs, outputs. No \"This code does...\" etc. Must start directly with summary content. Provide concise description of functionality: method data_received processes incoming bytes, handles timeout, custom payload parser, HTTP parsing, upgrades (websocket), error handling, payload handling, etc. Input: data bytes. Output: internal state changes, possibly feeding data to higher-level handlers, raising exceptions, closing transport. Provide business logic: parsing HTTP responses, handling empty bodies, upgrading connections, managing payload streams, timeout management. Let's craft.\n\nWe must not start with \"This code defines...\" but directly with summary. So start with something like:\n\n\"在 aiohttp 客户端协议中，`data_received` 方法负责接收并处理网络层返回的字节流...\"\n\nLet's produce Chinese summary. Include inputs: `data: bytes`. Outputs: internal state changes, possibly raising exceptions, closing transport, feeding parsed messages to higher-level consumer via `feed_data`. Mention handling of custom payload parser, HTTP parser, upgrade to WebSocket, empty body status codes, timeout rescheduling, EOF handling, error propagation.\n\nLet's write.assistantfinal在 aiohttp 客户端协议中，`data_received` 方法接收网络层返回的 `bytes` 数据并完成以下业务流程：\n\n1. **超时管理**：每次收到数据后调用 `_reschedule_timeout` 重新安排超时计时器，确保长时间无数据时能够触发超时关闭。\n\n2. **空数据快速返回**：若 `data` 为空直接返回，不产生后续处理。\n\n3. **自定义负载解析**  \n   - 当 `_payload_parser` 已设置时，使用其 `feed_data` 解析数据。  \n   - 若解析结束 (`eof=True`)，清除解析器并递归处理剩余的 `tail` 数据。\n\n4. **升级或普通 HTTP 解析**  \n   - 若已升级（如 WebSocket）或 `_parser` 为空，则把数据累加到 `_tail`，等待后续解析器建立。  \n   - 否", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:45:11.407174"}