{"summary": "- This code defines a client-side WebSocket response class for aiohttp library.\n- It imports necessary modules and defines a default timeout configuration for WebSocket.\n- It provides an asynchronous method `receive_bytes` that receives a WebSocket message.\n- The method receives a message with a ````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````...\nWe need to produce a summary of the functionality of the code snippet. The snippet is part of aiohttp/client_ws.py. It defines a client-side WebSocket response class for aiohttp library. It imports modules, defines default timeout config, provides async method receive_bytes that receives a WebSocket message and ensures it's binary, else raises WSMessageTypeError.\n\nWe need to follow the requirements:\n\n1. Start directly with the summary content. No \"This code does...\" or \"Here is...\".\n2. Focus on the business logic, inputs, and outputs.\n3. Use Chinese (e.g., Chinese/English).\n\nThus we need to produce a Chinese summary (maybe with some English terms). Should not start with \"This code does\". Should start directly with the summary.\n\nWe need to mention that it's a client-side WebSocket response class for aiohttp, imports, default timeout config, async method receive_bytes that receives a message, checks type, returns bytes, raises error if not binary.\n\nWe can also mention that the class likely inherits from something else (not shown) and that the method takes optional timeout parameter.\n\nWe need to summarize business logic: handling WebSocket messages, ensuring binary type, raising errors.\n\nWe need to mention inputs: optional timeout, returns bytes.\n\nWe need to mention outputs: bytes data of binary message, or exception.\n\nWe can also mention that default timeout config is defined as DEFAULT_WS_CLIENT_TIMEOUT with ws_receive=None, ws_close=10.0.\n\nWe can mention that the code imports various modules for handling WebSocket errors, messages, types, etc.\n\nWe need to produce a concise summary in Chinese.\n\nLet's produce:\n\n\"定义 aiohttp 客户端 WebSocket 响应类，导入所需模块，设定默认超时配置 DEFAULT_WS_CLIENT_TIMEOUT（接收无限制，关闭 10 秒），实现异步方法", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:35:52.223208"}