{"summary": "- 代码实现了一个异步函数 `extract_json_from_json`，用于从 **** **** **** **** **** **.\nThe user wants a summary of the functionality of the code. The code snippet is from instructor/utils.py. It includes imports, logger, type variables, and an async function extract_json_from_stream_async that takes an async generator of strings (chunks) and yields characters that form JSON objects. It tracks braces to capture JSON objects, yields characters while capturing, stops after closing brace.\n\nWe need to start directly with the summary content, no \"This code does...\" etc. Focus on business logic, inputs, outputs. Use Chinese (with English optionally). Provide summary.\n\nLet's craft a concise summary: The function processes a stream of text chunks, extracts JSON objects by tracking curly braces, yields each character of JSON objects as an async generator. Input: AsyncGenerator of strings. Output: AsyncGenerator of strings (characters) representing JSON objects.\n\nAlso mention that it stops after each JSON object, resets capturing.\n\nWe can also mention that the rest of the file defines types, imports, logger, but the core logic is the async function.\n\nLet's produce final answer.assistantfinal实现了一个异步 JSON 抽取工具 `extract_json_from_stream_async`，其业务逻辑如下：\n\n- **输入**：`chunks` – 一个 `AsyncGenerator[str, None]`，逐块提供原始文本（如 LLM 流式输出）。\n- **处理**：遍历每块字符，使用 `capturing` 标记和 `brace_count` 计数器实时追踪 `{` 与 `}` 的配对。当检测到第一个左花括号时开始捕获，随后每读到一个字符（包括嵌套的花括号）都直接 `yield`；当右花括号使计数归零时，说明当前 JSON 对象已完整，结束本次捕获并退出当前块的循环，准备捕获下一个对象。\n- **输出**：返回一个 `AsyncGenerator[str, None]`，按字符顺序输出完整的 JSON 对象字符串（不包括外部非 JSON 内容），每个对象在闭合 `}` 后即停止输出，随后可继续捕获后续对象。\n\n该函数可用于从 OpenAI、Claude 等模型的流式响应中实时提取嵌入的 JSON 数据，便于后续解析为结构化对象", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:39:46.648990"}