{"summary": "- Provides utility functions and classes for aiohttp library.\n- Includes basic authentication (BasicAuth), handling of HTTP headers, cookies, and ETag.\n- Implements caching for current datetime and formatting.\n- Provides functions for parsing and validating JSON content types.\n- Handles various HTTP methods and status codes.\n- Includes debugging and environment variable handling.\n- Provides various utility functions for string manipulation, tokenization etc.\nWe need to summarize functionality of the code snippet. The code is from aiohttp/helpers.py. It imports many modules, defines constants, regexes, functions like rfc822_formatted_time. The summary should focus on business logic, inputs, outputs. Provide Chinese/English. No intro phrase. Just start with summary content.\n\nLet's craft a concise summary: The module defines helper utilities for aiohttp: BasicAuth class, ChainMapProxy, ETag handling, reify decorator, functions for date formatting, token validation, JSON content type detection, cookie handling, etc. Provide details: rfc822_formatted_time returns HTTP-date string, caches per second. Constants for empty body status codes, methods, etc. Provide description of inputs/outputs.\n\nLet's produce final answer.assistantfinal提供 **aiohttp** 核心库的通用工具集合，主要业务逻辑包括：\n\n- **身份认证**  \n  - `BasicAuth`：根据用户名、密码（可选 charset）生成 HTTP `Authorization` 头部的 **Basic** 认证字符串。  \n    - **输入**：`login: str`, `password: str | None`, `encoding: str = \"utf-8\"`  \n    - **输出**：`Authorization: Basic <base64(login:password)>` 头部值。\n\n- **HTTP 头部、状态码与方法的常量/校验**  \n  - `EMPTY_BODY_STATUS_CODES`、`EMPTY_BODY_METHODS`：定义不应返回实体的状态码（204、304、1xx）和方法（HEAD 等），供请求/响应构造时快速判断是否需要写入 body。  \n  - `json_re`：正则匹配 `application/json` 或 `*/+json` 类型的 `Content-Type`，用于 **判断请求/响应是否为 JSON**。  \n  - `TOKEN`、`SEPARATORS`、`CHAR`、`CTL`：依据 RFC 7230 定义的字符集合，用于 **验证 HTTP token**（如 header 名称、ETag", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:40:19.129457"}