{"summary": "- The code defines a Pydantic model `UserExtractValidated` with fields `name` (string) and `age` (integer). \n- It includes a validator for `name` that ensures the input string is uppercase.\n- If the validation fails, it raises a `ValueError.\nThe user wants a summary of the functionality of the code. The code snippet is from tests/llm/test_gemini/test_patch.py. It imports product from itertools, BaseModel and field_validator from pydantic, pytest, instructor, google.generativeai as genai, and .util import models, modes. Then defines a class? Actually the snippet shows:\n\n```\nname: str age: int     @field_validator(\"name\")\n    @classmethod\n    def validate_name(cls, v: str) -> str:\n        if not v.isupper():\n            raise ValueError(\n                \"Name should be uppercase, make sure to use the `uppercase` version of the name (eg. TOM, JERRICK, ANNABETH)\"\n            )\n        return v\n```\n\nProbably inside a Pydantic BaseModel subclass called UserExtractValidated. The summary should mention that it validates name uppercase, raises error otherwise. Also mention inputs: name and age. Output: validated model instance or error.\n\nThe user wants Chinese (Chinese/English). So we can write Chinese description, maybe with some English terms.\n\nWe must start directly with the summary content, no preamble. So just start with the summary.\n\nLet's produce a concise summary in Chinese, maybe with some English terms.\n\nWe need to mention business logic: validation of name uppercase. Input: name string, age int. Output: validated model or exception.\n\nLet's produce.assistantfinal该模块定义了一个继承自 **pydantic.BaseModel** 的数据模型（如 `UserExtractValidated`），包含两个字段：  \n- **name**（`str`）  \n- **age**（`int`）  \n\n核心业务逻辑是对 **name** 字段进行校验：使用 `@field_validator(\"name\")` 装饰的类方法 `validate_name` 检查传入的字符串是否全部为大写 (`v.isupper()`)。  \n- 若满足大写要求，返回原值，模型实例化成功。  \n- 若不满足，则抛出 `ValueError`，提示 “Name should be uppercase, make sure to use the `uppercase` version of the name (eg.", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:01:36.652711"}