{"summary": "The code defines a test case for testing ****.\nWe need to produce a summary in Chinese (or Chinese/English) focusing on business logic, inputs, outputs. No \"This code does...\" etc. Must start directly with the summary content. So we need to describe what the test does: It parametrizes over models and modes, creates an instructor client from Gemini with a system instruction, sends a chat completion request with a response model UserExtractValidated, message \"Extract jason is 25 years old\", max_retries=5, then asserts that the returned object is instance of UserExtractValidated, name is \"JASON\", and raw response attribute exists.\n\nWe need to mention inputs: model, mode, message content. Output: instance of UserExtractValidated with name uppercase, raw response attribute.\n\nAlso mention that it uses pydantic BaseModel and field_validator maybe for validation (though not shown). The test ensures that the Gemini client correctly extracts user info and returns validated model.\n\nLet's produce a concise summary in Chinese, maybe with some English terms.\n\nStart directly with summary content. No preamble.\n\nLet's write:\n\n\"针对不同 Gemini 模型和运行模式，构造 instructor 客户端并发送一条用户信息抽取请求。输入为模型名称、模式以及消息 `Extract jason is 25 years old`，系统指令要求严格提取字段。调用 `client.chat.completions.create`，期望返回的 `response_model` 为 `UserExtractValidated`（基于 Pydantic），并在最多 5 次重试后得到结果。断言返回对象是 `UserExtractValidated` 实例，`name` 字段被规范化为大写 `\"JASON\"`，并且对象包含原始 Gemini 响应的 `_raw_response` 属性。\"\n\nThat should satisfy. No \"This code does\". Use Chinese. Provide business logic, inputs, outputs. Done.assistantfinal针对不同 Gemini 模型和运行模式，构造 instructor 客户端并发送一条用户信息抽取请求。输入为模型名称、模式以及消息 `Extract jason is 25 years old`，系统指令要求严格提取字段。调用 `client.chat.completions.create`，期望返回的 `response_model` 为 `UserExtractValidated`（基于 Pydantic），并在最多 5 次重试后得到结果。断言返回对象是 `UserExtractValidated` 实例，`name` 字", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:01:40.810110"}