{"summary": "The script generates a C header file for finding a header in a string. It reads the headers from a file and builds a dictionary.\nThe dictionary is used to create a code block.\nThe code block is the ```````````````````````````````````````````````````````...\nWe need to summarize functionality of the given code. The code snippet is incomplete but we can infer: tools/gen.py imports modules, defines ROOT, calculates headers via calc_headers(ROOT) (function not shown), defines TERMINAL = object(), builds a dictionary via build(headers). Then defines a C code template strings: HEADER, BLOCK, CASE, FOOTER. Then defines folder path. Then defines function gen(dct) that writes to a StringIO, writes HEADER, creates missing set, calls gen_block(dct, \"\", set(), missing, out) (function not shown), writes FOOTER with missing labels, returns out.\n\nThus business logic: generate C source code for a function find_header that uses a state machine (switch-case) to locate header strings. Input: dictionary mapping header strings to indices. Output: generated C code as a string (StringIO). It also tracks missing labels for headers not covered.\n\nWe need to summarize in Chinese, focusing on business logic, inputs, outputs. No \"This code does...\". Start directly with summary content. So something like:\n\n生成一个用于在字符数组中查找 HTTP 头部名称的 C 函数代码。读取项目根目录下的 aiohttp/hdrs.py（通过 calc_headers）得到所有头部名称列表，构建前缀树（build）映射每个字符到后继状态，随后在 gen(dct) 中依据该前缀树生成 C 代码块：HEADER 为函数声明和宏定义，BLOCK/CASE 为基于字符的 switch‑case 状态机，FOOTER 追加未匹配的标签列表。输入为头部名称字典 dct，输出为包含完整 C 实现的字符串流（StringIO），并在 FOOTER 中列出缺失的标签。\n\nMake sure to mention inputs and outputs. Provide Chinese/English mix maybe. Let's produce final answer.assistantfinal生成用于在字符数组中定位 HTTP 头部名称的 C 代码实现。  \n- **输入**：由 `calc_headers(ROOT)` 读取的所有头部名称列表，经 `build(headers)`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:33:04.929564"}