{"summary": "We need to summarize the functionality of the code snippet. The code is from Lib/imp.py, which is a deprecated module for import mechanisms. It imports many functions from _imp and importlib._bootstrap, etc. It defines constants for import types and a function load_package(name, path) that is deprecated. The function checks if path is a directory, then looks for __init__ file with source or bytecode suffixes, sets path accordingly, else raises ValueError. Then creates a module spec using spec_from_file_location with submodule_search_locations empty list. If module already in sys.modules, executes spec on existing module; else loads spec.\n\nThus summary: The code provides import-related utilities, defines constants for import types, and implements a deprecated load_package function that loads a package from a given filesystem path, handling __init__ file detection, creating a module spec, and either executing or loading the module.\n\nWe need to output in Chinese, focusing on business logic, inputs, outputs. No \"This code does...\" etc. So start directly with summary content. Provide Chinese description. Possibly include English terms for clarity.\n\nLet's craft final answer.assistantfinal实现了 Python 导入系统的底层辅助功能，并提供了一个已废弃的 `load_package` 接口。  \n\n**核心业务逻辑**  \n- 通过 `from _imp import …`、`importlib._bootstrap`、`importlib._bootstrap_external` 等模块，暴露底层锁管理、冻结模块、内建对象检测、代码对象修正等一系列内部 API，供上层 import 机制使用。  \n- 定义了一组常量（`SEARCH_ERROR`、`PY_SOURCE`、`PY_COMPILED`、`C_EXTENSION`、`PY_RESOURCE`、`PKG_DIRECTORY`、`C_BUILTIN`、`PY_FROZEN`、`PY_CODERESOURCE`、`IMP_HOOK`），标识不同的模块加载类型。  \n\n**`load_package(name, path)`（已废弃）**  \n- **输入**：`name`（待加载的包名），`path`（文件系统路径，可为目录或 `__init__` 文件）。  \n- **处理**：  \n  1. 若 `path` 为目录，遍历 `machinery.SOURCE_SUFFIXES` 与 `machinery.BYTECODE_SUFFIXES`，在目录下寻找 `__init__` + 相应后", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:59:53.824293"}