{"summary": "We have a snippet from aiohttp's client WebSocket implementation. It defines a class `ClientWebSocketResponse` with a default timeout set.\nThe code includes imports and imports etc... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... \nWe need to produce a summary of functionality, focusing on business logic, inputs, outputs. Use Chinese. No \"This code does...\" etc. So just start with summary content. Provide Chinese description of what the code does: It defines a client-side WebSocket response class, handling sending binary data, managing timeouts, etc. Provide inputs: data bytes, optional compress flag. Output: coroutine that sends frame. Also mention imports and error handling. Provide business logic: validation of data type, raising TypeError, using writer to send frame with binary message type. Provide default timeout config. Provide that it's part of aiohttp client library for asynchronous WebSocket communication. So produce Chinese summary. Let's do it.assistantanalysisWe need to produce a summary directly, no preamble. Should be Chinese, but can include English terms. Should mention business logic, inputs, outputs. Let's craft:\n\n- 代码位于 aiohttp.client_ws 模块，定义了 ClientWebSocketResponse 类的默认超时配置 DEFAULT_WS_CLIENT_TIMEOUT，使用 ClientWSTimeout 对象，接收超时为 None，关闭超时为 10 秒。\n\n- send_bytes 方法是一个 async 协程，接受 data (bytes/bytearray/memoryview) 和可选 compress 参数（int）。首先检查 data 是否属于字节类，不符合则抛 TypeError。随后调用内部的 WebSocketWriter 实例的 send_frame 方法，发送二进制帧（WSMsgType.BINARY），并把 compress 参数传递给底层实现。\n\n- 方法没有返回值，成功时完成协程；异常情况包括类型错误或底层写入错误（WebSocketError 等），会向调用者传播。\n\n- 该代码是客户端 WebSocket 的业务层，负责把用户提供的二进制数据封装为 WebSocket 二进制帧并通过网络写入，实现异步发送。\n\nNow produce final answer.assistantfinal在 aiohttp 的客户端 WebSocket 实现中，`ClientWebSocketResponse` 提供默认的超时配置 `DEFAULT_WS_CLIENT", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:35:32.665448"}