{"summary": "We have a code snippet from modin/polars/base.py. It defines a class BasePolarsDataset. It imports __future__ annotations, etc. It imports polars and BaseQueryCompiler. It defines a private attribute _query_compiler of type BaseQueryCompiler. Then defines __neg__ method that returns a new instance of the same class (via __constructor__) with a query compiler that is the negative of the original. So the business logic: applying unary minus operator to a dataset returns a new dataset with all numeric values negated. Input: the dataset instance; output: a new dataset instance with negative values.\n\nThus the summary: The code defines a dataset wrapper for Polars that delegates operations to a query compiler; the __neg__ method implements unary minus by calling the query compiler's negative method and constructing a new dataset.\n\nNow produce the answer in Chinese.assistantanalysisWe need to produce a summary in Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" etc. So start with something like \"对 BasePolarsDataset 类实现了取负运算...\" Provide business logic, inputs, outputs. Let's craft.assistantfinal对 `BasePolarsDataset` 类实现了取负（unary minus）运算。  \n- **业务逻辑**：当对数据集实例使用负号（`-dataset`）时，内部调用其持有的 `_query_compiler`（`BaseQueryCompiler` 实例）的 `negative()` 方法生成取负后的查询计划，然后通过 `__constructor__` 创建并返回一个新的 `BasePolarsDataset` 对象。  \n- **输入**：当前的 `BasePolarsDataset` 实例（包含原始数据的查询编译器）。  \n- **输出**：一个新的 `BasePolarsDataset` 实例，其内部查询编译器已被转换为对应的取负操作，等价于对所有数值列执行 `-value`。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:59:14.814786"}