{"summary": "We need to summarize the functionality of the code snippet. The code is from aiohttp/client.py. It imports many modules, defines __all__, constants, types, etc. The snippet includes a class? Actually we see __slots__ = (\"_coro\", \"_resp\") and async def __aexit__ method. This appears to be part of a request context manager class that wraps a coroutine and response. The code defines many imports and exception classes, request/response classes, connectors, cookie jar, helpers, etc. The business logic: It provides asynchronous HTTP client functionality, including request handling, response parsing, websockets, connection management, timeouts, authentication, proxy handling, etc. The inputs: URL, method, headers, data, json, params, cookies, auth, timeout, proxy, ssl, etc. The outputs: ClientResponse or ClientWebSocketResponse objects, raising appropriate exceptions.\n\nBut the snippet only shows imports and definitions, not the full class. However we can summarize the overall module's purpose: aiohttp client library for making HTTP requests asynchronously, providing ClientSession, request functions, handling timeouts, redirects, SSL, websockets, etc.\n\nWe need to follow requirements: start directly with summary content, no \"This code does...\". Provide business logic, inputs, outputs. Use Chinese (maybe mixed Chinese/English). So we can write:\n\n- 提供异步 HTTP 客户端核心实现，封装请求/响应、连接池、超时、重定向、代理、SSL、Cookie、WebSocket 等功能。\n- 主要入口类 `ClientSession`（在后续代码中定义），通过 `request`、`get`、`post` 等方法接受 URL、method、headers、params、data、json、cookies、auth、timeout、proxy、ssl 等参数，返回 `ClientResponse`（普通 HTTP）或 `ClientWebSocketResponse`（WebSocket）对象，支持 `async with` 上下文管理。\n- 内部使用 `BaseConnector`（TCP/Unix/NamedPipe）管理底层 socket，`CookieJar` 维护 cookie，`TraceConfig` 进行请求链路追踪，`ClientTimeout` 统一超时配置，`Fingerprint` 用于服务器证书指纹校验。\n- 定义大量异常类（如 `ClientConnectionError`, `ClientResponseError`, `TooManyRedirects` 等），在请求过程中的各种错误会抛出对应异常。\n- 实现 `_", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:47:20.009526"}