{"summary": "The provided code defines a multipart handling module for aiohttp. It includes:\n- ****.\nThe summary should focus on the ****.\nWe need to summarize functionality of the code snippet. The snippet is part of aiohttp multipart handling. It defines imports, __all__, a constant chunk_size, and a class __init__ method (likely for BodyPartReader or MultipartReader). The snippet includes class __init__ signature with parameters: boundary, headers, content, subtype default \"mixed\", default_charset optional. It sets internal attributes: headers, boundary, boundary length, content, default charset, at_eof flag, is_form_data flag based on subtype, length handling (if not form-data, get CONTENT_LENGTH header), read_bytes, unread deque, prev_chunk, content_eof, cache dict.\n\nThus summary: This module provides multipart parsing and writing for aiohttp. The class (likely MultipartReader) reads multipart bodies, handling boundaries, headers, content streams, supports form-data detection, tracks bytes read, supports charset, etc. Input: boundary bytes, headers dict, StreamReader content, optional subtype and charset. Output: internal state for reading parts; later methods will yield parts.\n\nWe need to produce Chinese summary focusing on business logic, inputs, outputs. No \"This code does\". Start directly with summary content. Provide Chinese/English mix maybe.\n\nLet's craft: \"实现对 HTTP multipart 请求/响应的解析与构造，核心类在初始化时接受边界、头部、内容流等信息，依据 subtype 判断是否为 form-data，解析 Content‑Length，维护读取进度、未消费缓冲、缓存等状态，为后续逐段读取提供基础。\" Provide details.\n\nLet's write final answer.assistantfinal实现对 HTTP multipart 消息的解析与构造。核心类在构造函数中接受以下输入：\n\n* `boundary: bytes` – multipart 消息的分隔符。  \n* `headers: CIMultiDictProxy[str]` – 当前 part（或整体）携带的 HTTP 头部集合。  \n* `content: StreamReader` – 包含整个 multipart 内容的异步流读取器。  \n* `subtype: str = \"mixed\"` – multipart 的子类型，若为 `\"form-data\"` 则标记为表单数据。  \n* `default_charset: Optional[str]` – 当内容未声明字符集时使用的默认字符集。\n\n在初始化阶段完成的业务逻辑包括：\n\n1.", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:48:31.980380"}