{"summary": "We need to summarize the functionality of the code snippet. The snippet is from scripts/release.py. It imports many modules: argparse, atexit, collections, json, re, sys, pathlib.Path, github, pygit2, packaging.version. Then defines a function _add_section(section, prs) that uses nonlocal notes, and if prs is non-empty, adds a markdown bullet for the section, then adds bullet points for each PR object sorted by message, using wrapper.ensure_title_link(obj). So the code is part of a release script that generates release notes. The function adds a section to release notes.\n\nWe need to summarize business logic, inputs, outputs. The function takes a section name (string) and a list of PR objects, and appends formatted markdown to a variable notes. It returns nothing (modifies notes). It uses wrapper.ensure_title_link to format each PR.\n\nThus summary: The script is for generating release notes for a GitHub repository, using PR data, sorting, formatting. The function adds a markdown section.\n\nWe need to output in Chinese (with English optionally). Provide summary directly. No preamble. Let's do that.assistantfinal该脚本是用于自动生成 GitHub 项目发布说明的工具，核心业务逻辑包括：\n\n- **输入**：  \n  - `section`（字符串）：要在发布说明中添加的章节标题，如 “Features”、 “Bug Fixes”。  \n  - `prs`（列表）：GitHub Pull Request 对象集合，每个对象包含 `message`（标题）等属性，通常由前置的 API 调用或 Git 提交日志获取。  \n\n- **内部处理**：  \n  - 通过 `nonlocal notes` 访问并修改外层作用域的 `notes` 变量（累计的 Markdown 文本）。  \n  - 若 `prs` 非空，则在 `notes` 中先写入章节标题的一级列表项 `* {section}`。  \n  - 对 `prs` 按 `obj.message` 进行字典序排序，确保发布说明条目有序。  \n  - 对每个 PR 调用 `wrapper.ensure_title_link(obj)`（包装器函数）生成带有标题链接的 Markdown 子列表项，形如 `  * [标题](链接)`。  \n  - 将所有子列表项拼接并追加到 `notes`，每个章节后自动换行。\n\n- **输出**：  \n  -", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:44:07.703648"}