{"summary": "- The script defines a CLI tool using Typer for analyzing OpenAI API usage data.\n- It reads the OpenAI API key from environment variables.\n- A dictionary `MODEL_COSTS` maps model names to per-token cost rates for prompts and completions.\n- The core function `group_and_sum_by_date_and_snapshot` takes a list of usage records (each a dict with keys like `snapshot_id`, `aggregation_timestamp`, `n_requests`, `n_generated_tokens_total`, `n_context_tokens_total`), aggregates them by date (converted from timestamps) and model snapshot, computes total requests, total tokens and total cost using `calculate_cost` (which presumably follows the `MODEL_COSTS` mapping). It then builds a Rich RichTable (Rich) to display the aggregated results.\n- The function returns a Rich Table.\nWe need to produce a summary of functionality, focusing on business logic, inputs, outputs. Use Chinese (maybe mix Chinese/English). Must start directly with summary content, no \"This code does...\". So start with something like \"该脚本实现了...\" etc. Provide details: CLI tool, reads env var, model cost mapping, function aggregates usage data, calculates cost, returns Rich Table. Also mention that calculate_cost is referenced but not defined here. Provide inputs: list of dict usage data. Output: Rich Table object. Also mention that Typer app defined but not used in snippet. Provide business logic: grouping by date and snapshot, summing requests, tokens, cost. Use Chinese. Let's craft.assistantfinal该脚本实现了一个基于 **Typer** 的命令行工具，用于对 OpenAI API 的使用情况进行统计与展示，核心业务逻辑如下：\n\n1. **环境配置**  \n   - 从环境变量 `OPENAI_API_KEY` 读取 OpenAI API Key，供后续调用 OpenAI 接口（虽然本段代码未直接使用，但为整个 CLI 提供凭证）。\n\n2. **模型计费规则**  \n   - `MODEL_COSTS` 字典映射每个模型（如 `gpt‑4o`、`gpt‑3.5‑turbo`、`text‑embedding‑3‑small` 等）到其 **prompt** 与 **completion** 的每千 token 费用（单位：美元/千 token）。  \n   - 计费规则在后续的 `calculate_cost`（本文件未实现）中被引用，用于计算单条", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:55:34.670753"}