{"summary": "The code defines a CLI (typer) application.\nWe need to summarize functionality, business logic, inputs, outputs. Provide Chinese. No intro phrase. Just start with summary.\n\nLet's read code: It's a CLI usage script. It imports typer, aiohttp, asyncio, rich console/table/progress. It defines app = typer.Typer() console = Console(). Reads OPENAI_API_KEY env var. Defines MODEL_COSTS dict mapping model names to cost per token for prompt/completion (or per embedding). Then defines async function fetch_usage(date: str) -> dict[str, Any] that calls OpenAI usage endpoint with date param, using API key, returns JSON.\n\nProbably there are more functions later (not shown). But we need to summarize given code snippet. So summary: CLI tool to query OpenAI usage for a given date, compute cost per model based on token usage, display via rich tables/progress. Input: date string (YYYY-MM-DD). Output: usage data dict, possibly printed table.\n\nLet's craft summary: This script provides a command-line interface that, given a date, fetches OpenAI API usage via the /v1/usage endpoint using the API key from environment, then uses predefined per-token cost rates to calculate monetary cost per model, aggregates, and presents results in a formatted table with progress indicator. It uses async HTTP request.\n\nWill mention that MODEL_COSTS includes both prompt/completion and embedding costs.\n\nOk produce Chinese summary.assistantfinal提供一个基于 **Typer** 的命令行工具，用于查询并展示指定日期（`YYYY‑MM‑DD`）的 OpenAI API 使用情况。  \n\n**核心业务逻辑**  \n1. 从环境变量 `OPENAI_API_KEY` 读取 OpenAI 访问令牌。  \n2. 通过 `aiohttp` 异步请求 `https://api.openai.com/v1/usage?date={date}`，获取该日期的原始使用数据（JSON），返回结构为 `dict[str, Any]`。  \n3. 依据 `MODEL_COSTS` 中预定义的每千 token（或每千次嵌入）费用，对返回的 token 使用量（prompt/completion）或嵌入计数进行费用计算。  \n4. 使用 **Rich** 的 `Console`、`Table`、`Progress` 等组件，将每个模型的使用量、费用等信息以表格或进度条的形式美化输出到", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:55:21.204852"}