{"summary": "该测试用例验证了 `is_async` 函数的行为。它首先创建一个异步函数 `async_function`，然后使用 `functools.wraps` 包装该函数得到 `wrapped_function`，此时 `wrapped函数` 被包装成了 **“”** **“”。\n\n\n\nThe user asks: \"You are a senior code analyst. Summarize the functionality of the following code. Requirements: 1. Start directly with the summary content. No \"This code does...\" or \"Here is...\". 2. Focus on the business logic, inputs, and outputs. 3. Use Chinese (e.g., Chinese/English).\"\n\nThey provide code snippet and a partially written summary. We need to produce a summary that meets the requirements: start directly with summary content, no \"This code does...\" etc. Focus on business logic, inputs, outputs. Use Chinese (maybe with some English). The code is a test file for a function is_async. It defines an async function, wraps it with functools.wraps, then asserts that is_async returns True for the wrapped function. So the summary should explain that the test checks that is_async correctly identifies a wrapped async function as async. Input: wrapped_function; output: boolean True. Business logic: test case for is_async.\n\nWe need to start directly with the summary content. So maybe:\n\n\"验证 `is_async` 能正确识别被 `functools.wraps` 包装后的异步函数。输入为通过 `functools.wraps` 包装的 `async_function`（即 `wrapped_function`），期望输出 `True`，通过 `assert` 断言实现。\"\n\nThat meets requirements. Use Chinese. Provide summary only. No extra fluff. Let's produce that.assistantfinal验证 `is_async` 能正确识别被 `functools.wraps` 包装后的异步函数。输入为通过 `functools.wraps` 包装的 `async_function`（即 `wrapped_function`），期望输出 `True`，通过 `assert is_async(wrapped_function) is True` 断言实现。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:47:27.100066"}