{"summary": "We have a code snippet from instructor/function_calls.py. It imports various modules, including OpenAISchema, json, logging etc. It defines a logger, etc.\n\nThe code defines a class property (classproperty) that returns a schema for Anthropic.\n\nThe code is incomplete.\n\nWe need to summarize the functionality.\n\nWe need to focus on business logic, inputs, outputs.\n\nThus we need to produce a summary in Chinese.\n\nWe need to start directly with the summary content.\n\nWe need to not use \"This code does...\" etc.\n\nWe need to mention that the code defines a class property that returns a dict with name, description, input_schema.\n\nThus the summary: The code defines a class property that returns a schema for Anthropic based on the OpenAI schema and model JSON schema.\n\nThus we need to produce a Chinese summary.\n\nWe need to mention that the code imports modules, sets up logger, defines a class property.\n\nThus the summary: The code defines a class property that returns a dict containing name, description, input_schema for Anthropic.\n\nThus we need to produce a Chinese summary.\n\nWe need to start directly with the summary content.\n\nThus: \"提供一个类属性anthropic_schema，返回包含name、description、input_schema的字典，基于OpenAI schema和模型的JSON schema。\"\n\nWe need to mention that the code imports modules, sets up logger, defines a class property.\n\nThus: \"导入OpenAISchema、json、logging等模块，创建logger，定义classproperty anthro...\".\n\nThus final answer: Chinese summary.\n\nWe need to follow the requirement: \"Start directly with the summary content. No \"This code does...\" or \"Here is...\".\"\n\nThus we start with \"提供一个类属性...\"\n\nThus final answer: Chinese summary.assistantfinal提供一个类属性 `anthropic_schema`，返回包含模型名称、描述以及输入 JSON Schema 的字典，数据来源于 `openai_schema`（包括 `name`、`description`）和模型的 `model_json_schema()`。代码先导入 OpenAI、JSON、日志、装饰器、类型注解等依赖，创建名为 `instructor` 的日志记录器，并使用 `classproperty` 装饰器实现该只读类属性，以便在调用时动态生成符合 Anthropic 平台要求的函数调用描述。输入为类本身的 OpenAI schema 与模型定义，输出为符合 Anthropic 规范的函数描述结构。", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:45:21.180532"}