{"summary": "- This code defines a decorator `distil` for tracking function calls and responses, supporting two modes: \"distil\" (default) and \"dispatch\".\n- The decorator can be applied directly without arguments or with optional parameters (`name`, `mode`, `model`, `fine_tune_format`).\n- In \"distil\" mode, it executes the original function, records its inputs and output via `self.track` (likely a logging or data collection method), and returns the original result.\n- In \"dispatch\" mode, it constructs a request to the OpenAI API using `self.client` and `self.openai_kwargs` (the latter is a helper method to format the request payload.\nWe need to produce final answer: summary content directly, no intro. Should be Chinese (maybe mixed). Provide business logic, inputs, outputs. Let's craft.\n\nWe need to mention that decorator expects function returning pydantic BaseModel subclass. It validates. In dispatch mode returns ChatCompletion from OpenAI. In distil mode returns the BaseModel instance. It also tracks calls.\n\nAlso mention parameters: name optional, mode literal, model default gpt-3.5-turbo, fine_tune_format optional.\n\nOutputs: either Callable that returns BaseModel or ChatCompletion.\n\nLet's produce final answer.assistantfinal- **功能概述**  \n  提供 `distil` 装饰器，用于在函数调用前后自动与 OpenAI ChatCompletion 接口交互并记录（distill）调用数据。装饰器支持两种工作模式：  \n  * **distil（默认）** – 直接执行被装饰函数，返回其原始 `pydantic.BaseModel` 实例，同时调用 `self.track` 将函数名、入参、返回值以及可选的微调格式写入日志/数据库。  \n  * **dispatch** – 不执行原函数，而是把函数签名、入参等信息包装成 OpenAI 请求，调用 `self.client.chat.completions.create`，返回 OpenAI 的 `ChatCompletion` 对象。\n\n- **输入参数**  \n  ```python\n  @distil(\n      name: Optional[str] = None,          # 自定义函数标识，默认使用函数名\n      mode: Literal[\"distil\",\"dispatch\"] = \"distil\",  # 运行模式\n      model: str = \"gpt-3.5-turbo\",        # 调用的 OpenAI 模", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:38:24.811983"}