{"summary": "The code defines a test case for testing ****.\nWe need to produce a summary of the functionality of the code, focusing on business logic, inputs, outputs, in Chinese (with possible English). Must start directly with the summary content, no \"This code does...\" or similar. So we need to produce a concise description: The test uses pytest to parametrize over models and modes, creates an instructor client with prompt caching enabled, sends a chat completion request with a system message containing a long story and a user message asking to extract a user, expects response model User with name Mike age 37, asserts response type and cache usage. So the summary: It tests that the system message caching works and that the extraction works.\n\nWe need to mention inputs: model, mode, client, messages, temperature, max_tokens. Output: response (User), message usage stats. Business logic: test creation with system cache, verifying extraction and caching.\n\nLet's produce Chinese summary. Ensure no \"This code does...\" etc. Start directly with summary content. Use Chinese. Possibly include English terms like \"User\". Provide clear description.\n\nLet's write:\n\n\"在 pytest 框架下，对不同模型和模式组合进行参数化测试，使用 instructor 包装的 Anthropic 客户端并开启提示缓存。向 `client.chat.completions.create_with_completion` 发送包含系统角色长文本（重复的 `<story>Mike is 37 years old ...</story>`）和指示性说明的消息，以及用户角色的提取指令。请求返回的 `response` 被映射为 `User` 数据模型，断言其 `name` 为 “Mike”、`age` 为 37。随后检查返回的 `message.usage` 中的缓存统计字段，确保出现缓存写入或读取（`cache_creation_input_tokens` 或 `cache_read_input_tokens` 大于 0）。\"\n\nThat should satisfy. No leading \"The code defines\". Just start with summary. Let's output.assistantfinal在 pytest 框架下，对不同模型和模式组合进行参数化测试，使用 instructor 包装的 Anthropic 客户端并开启提示缓存。向 `client.chat.completions.create_with_completion` 发送包含系统角色长文本（重复的 `<story>Mike is 37 years old ...</story>`）和指示性说明的消息，以及用户角色的提取指令。请求返回的 `response` 被映射为 `User` 数据模型，断言", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T21:02:49.223750"}