{"summary": "- This code defines a StreamResponse class for handling HTTP responses in an aiohttp web server.\n- It imports various modules and defines constants and helper functions.\n- The class has several attributes and methods for managing the response body, headers, status code, and other aspects.\n- The last_modified property setter allows setting the Last-Modified header based on a timestamp or datetime object.\n- The code also defines a json_response function that returns a JSON response.\nWe need to produce a summary in Chinese (or Chinese/English) focusing on business logic, inputs, outputs. No \"This code does...\" etc. Must start directly with summary content. Should summarize functionality: StreamResponse class, handling HTTP response, managing headers, status, body, compression, cookies, etc. Provide inputs: request, payload, status, headers, etc. Outputs: HTTP response sent to client. Also json_response function.\n\nLet's craft concise Chinese summary.\n\nStart directly: \"提供用于在 aiohttp Web 服务器中构建和发送 HTTP 响应的 StreamResponse 类...\"\n\nMake sure not to start with \"This code does\". Use Chinese.\n\nLet's produce final answer.assistantfinal提供用于在 aiohttp Web 服务器中构建和发送 HTTP 响应的 **StreamResponse** 类及辅助函数。  \n\n- **核心业务逻辑**  \n  - 管理响应体（支持 `bytes`、`bytearray`、`Payload`），实现分块传输、内容长度校验、自动压缩（gzip/deflate）以及保持连接（keep‑alive）等细节。  \n  - 维护响应头部集合，支持设置状态码、原因短语、`Last-Modified`、ETag、Cookie 等标准字段，并提供对 `Content‑Encoding`、`Content‑Length`、`Transfer‑Encoding` 的自动处理。  \n  - 通过内部的 `_payload_writer` 将数据异步写入底层网络流，确保在发送完毕后正确标记 EOF。  \n  - 支持在响应创建时传入请求对象 (`_req`) 以便依据客户端的 `Accept‑Encoding` 决定是否强制压缩或使用特定压缩策略。  \n\n- **输入**  \n  - 构造函数或属性赋值时可接受：`status`（整数 HTTP 状态码）、`reason`（可选自定义短语）、`headers`（字典或 `CIMultiDict`", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:56:03.916263"}