{"summary": "- This module implements a zipimporter class for importing Python modules from zip archives.\n- It defines constants and tables for handling zip file structures, such as end-of-central-directory record, string markers.\n- It provides a cache for zip directories and a search order for module files within the zip.\n- It includes utility functions for comparing timestamps and handling character encoding.\n- The module imports various internal Python modules for low-level operations like file I/O, marshaling, and warnings.\n```\"\n\nWe need to produce a summary in Chinese (or Chinese/English). The user says: \"Use Chinese (e.g., Chinese/English).\" So we can write Chinese, maybe with some English terms. Must start directly with the summary content, no \"This code does...\" or \"Here is...\". So start with a concise description.\n\nWe need to focus on business logic, inputs, outputs. The code is part of zipimporter. So we can say: 实现 zipimporter 类, 用于从 zip 包导入模块, 输入是 zip 文件路径, 输出是模块对象, etc. Also mention constants, caches, search order, timestamp comparison, encoding table.\n\nLet's produce a Chinese summary. Ensure no leading phrase like \"This code\". Just start with the summary.\n\nLet's write:\n\n\"实现 zipimporter 类，支持从 zip 压缩包中加载 Python 模块和包。...\"\n\nMake sure to mention inputs: zip archive path, module name; outputs: loaded module object, errors via ZipImportError. Also mention internal functions: _eq_mtime for timestamp comparison, caches, etc.\n\nLet's produce final answer.assistantfinal实现 `zipimporter` 类，提供从 ZIP 压缩包中导入 Python 模块和包的功能。  \n- **输入**：ZIP 文件路径（通过 `zipimporter(path)` 实例化），以及待导入的模块名（如 `zipimporter.find_module(name)`、`zipimporter.load_module(name)`）。  \n- **业务逻辑**：  \n  1. 解析 ZIP 文件结构，使用常量（如 `END_CENTRAL_DIR_SIZE`、`STRING_END_ARCHIVE`）定位并读取中央目录、文件头等元数据。  \n  2. 维护 `_zip_directory_cache` 缓存已解析的目录，以加速后续查找。  \n  3. 按 `_zip_searchorder` 定义的顺序搜索模块文件（`__init", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:55:26.605142"}