{"summary": "- The code defines a class method `model_from_chunks_async` that processes an asynchronous generator of JSON strings (`json_chunks`). It concatenates the chunks.\n- It uses `jiter` library (jiter``) to parse the ****.\nThe user wants a summary of the functionality of the code, focusing on business logic, inputs, outputs, in Chinese (or Chinese/English). Must start directly with the summary content, no \"This code does...\" etc. So we need to produce a concise summary.\n\nWe need to understand the code snippet. The snippet is from instructor/dsl/partial.py PartialBase. It imports many modules. The key part is the class method `model_from_chunks_async`. It takes `json_chunks` which is an AsyncGenerator of strings, and **kwargs. It returns an AsyncGenerator of T_Model (a subclass of BaseModel). It concatenates incoming chunks into a string `potential_object`. It obtains a partial model via `cls.get_partial_model()`. It determines `partial_mode` based on whether the class inherits from `PartialLiteralMixin`. Then for each chunk, it adds to `potential_object`, then uses `jiter.from_json` to parse the accumulated string (strip or \"{}\") into a JSON object, with partial_mode. Then validates the object against the partial model using `model_validate`. Then yields the validated model.\n\nThus the business logic: incremental parsing of streaming JSON data, building partial Pydantic models as data arrives, supporting partial parsing modes.\n\nInputs: async generator of JSON string chunks, optional kwargs for validation.\n\nOutputs: async generator yielding validated Pydantic model instances (partial).\n\nAlso mention that it uses `jiter` for incremental parsing, and `partial_mode` can be \"on\" or \"trailing-strings\". The method is async.\n\nNow produce summary in Chinese, maybe with some English terms.\n\nLet's craft.\n\nNeed to start directly with summary content, no preamble.\n\nLet's produce:\n\n\"该类方法...\"\n\nBut must not start with \"该代码...\"? The requirement: \"Start directly with the summary content. No 'This code does...' or 'Here is...'.\" So we can start with \"用于...\"? That's okay. The phrase \"用于\" is fine. The requirement is to avoid generic intro sentences like \"This code does...\". So we can start with \"在异步流式 JSON 解析场景下，...\" etc.\n\nLet's produce.\n\nAlso mention that it returns AsyncGenerator[T_Model, None].\n\nLet's produce final answer.", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:57:25.355955"}