{"summary": "We need to summarize the functionality of the code snippet. The snippet is from aiohttp/helpers.py. It includes many imports and definitions. The code defines constants, regex patterns, and a ChainMapProxy class? Actually __all__ includes \"BasicAuth\", \"ChainMapProxy\", \"ETag\", \"reify\". The snippet includes definitions of sentinel, NO_EXTENSIONS, EMPTY_BODY_STATUS_CODES, etc. It defines character sets for HTTP token parsing, regex for JSON content type, etc. It also defines cached datetime variables, ETag regex patterns, etc. The snippet ends with __slots__ = (\"_maps\",) and overload for __getitem__.\n\nThus the business logic: Provide helper utilities for aiohttp library: authentication handling (BasicAuth), chain map proxy for mapping, ETag parsing and handling, reify property caching, constants for HTTP behavior, regex for content type detection, token validation, etc. Input: various HTTP headers, content types, etc. Output: processed values like parsed ETag, token validation, etc.\n\nWe need to summarize in Chinese, focusing on business logic, inputs, outputs. No \"This code does\". So start directly with summary.\n\nLet's craft a concise summary: The module defines utility classes and functions used by aiohttp for HTTP handling: BasicAuth for encoding credentials, ChainMapProxy for read‑only view of multiple mappings, ETag parsing/validation, reify decorator for cached properties, constants for empty bodies, debug mode, token characters, regex for JSON content type detection, etc. It also caches current datetime for header generation. The inputs are HTTP headers, credentials, mapping objects; outputs are encoded auth header, combined mapping view, parsed ETag objects, boolean checks, formatted datetime strings.\n\nLet's produce final answer.assistantfinal提供 aiohttp 核心的通用工具集合，主要业务逻辑包括：\n\n- **BasicAuth**：接受用户名、密码及可选的字符集，生成符合 RFC 7617 的 `Authorization: Basic …` 头部值（输入为凭证字符串，输出为 Base64 编码的认证头）。\n- **ChainMapProxy**：对多个映射对象创建只读视图，支持键查询、迭代和长度计算（输入为若干 `Mapping`，输出为统一的只读映射接口）。\n- **ETag**：实现 ETag 解析与匹配规则，使用正则 `QUOTED_ETAG_RE`、`LIST_QUOTED", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:42:39.136947"}