{"summary": "We need to summarize the functionality of the code snippet. The snippet is from Lib/wave.py, includes imports, defines __all__, constants for wave format, defines a namedtuple _wave_params, defines a function getmark that raises Error. The code is incomplete. But we need to summarize business logic, inputs, outputs. The code defines constants for PCM and extensible wave format, defines a GUID for PCM subtype, defines array format mapping, defines a namedtuple for wave parameters (channels, sample width, framerate, frames, compression type/name). The getmark method is part of a class (likely Wave_read) that raises an error indicating no marks. So the functionality: provides wave file handling, open function, error class, Wave_read and Wave_write classes. The snippet only shows constants and a placeholder method. So summarizing: This module implements reading/writing of WAV audio files, exposing open, Error, Wave_read, Wave_write. It defines constants for PCM format, extensible format, and a GUID for PCM subtype. It defines a namedtuple for wave parameters. The getmark method raises an error because marks are not supported.\n\nThus summary: The code defines the public API of wave module, constants, data structures, and a method that raises error for unsupported marks. No inputs/outputs beyond raising error.\n\nLet's produce Chinese summary.assistantfinal提供 WAV 音频文件的读写接口。  \n- 通过 `__all__` 暴露 `open`, `Error`, `Wave_read`, `Wave_write` 四个公共对象。  \n- 定义了两种波形格式标识常量：`WAVE_FORMAT_PCM = 0x0001`（线性 PCM）和 `WAVE_FORMAT_EXTENSIBLE = 0xFFFE`（可扩展格式），以及 PCM 子类型的 GUID `KSDATAFORMAT_SUBTYPE_PCM`（用于 WAVE_FORMAT_EXTENSIBLE）。  \n- `_array_fmts` 用于映射不同采样宽度到对应的 `array` 模块格式字符（如 `'b'`、`'h'`、`'i'`），供后续数据打包/解包使用。  \n- `_wave_params` 是一个 `namedtuple`，封装 WAV 文件的关键参数：通道数 `nchannels`、采样宽度 `sampwidth`、帧率 `framerate`、总帧数 `nframes`、压缩", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:52:56.010047"}