{"summary": "- 解析 multipart/form-data 请求体，提取并处理文件名、内容等信息。\n- 提供 `content_disposition_filename` 函数用于从 Content‑Disposition 头部获取文件名，支持 RFC RFC RFC RFC RFC RFC RFC RFC\n\n\n\nThe user wants a summary of the functionality of the given code. The code snippet is from aiohttp/multipart.py. The user gave requirements: start directly with the summary content, no \"This code does...\" etc. Focus on business logic, inputs, outputs. Use Chinese (e.g., Chinese/English). So we need to produce a Chinese summary (maybe with some English terms). The code snippet includes imports, __all__, and a function content_disposition_filename. The summary should describe the functionality of the code: parsing multipart/form-data request bodies, extracting filenames from Content-Disposition header, handling RFC 2231 encoding, etc. Also mention other classes like MultipartReader, MultipartWriter, BodyPartReader, etc. But the snippet only shows the function content_disposition_filename. However __all__ includes other classes. The summary should cover the overall module's purpose: handling multipart data in aiohttp, providing reader/writer, parsing content disposition, etc.\n\nWe need to follow requirement: start directly with summary content, no \"This code does...\" So start with something like \"实现对 multipart/form-data 请求体的解析与构造，提供读取、写入、文件名提取等功能。\" Then describe inputs: Content-Disposition header parameters mapping, name param default \"filename\". Output: optional filename string, handling RFC 2231 encoded parameters, concatenating split parts, decoding percent-encoding, returning None if not found.\n\nAlso mention that the module defines MultipartReader, MultipartWriter, BodyPartReader, and related exceptions, used in aiohttp for handling multipart HTTP messages.\n\nLet's craft a concise Chinese summary with some English terms.\n\nMake sure to not start with \"This code does\". Use direct description.\n\nLet's produce final answer.assistantfinal实现对 **multipart/form-data** 请求体的解析与构造，提供以下核心业务功能：\n\n- **MultipartReader / MultipartWriter / BodyPartReader**：在 aiohttp 中负责读取、写入和遍历 multipart 消息的各个子部件（表单字段、文件流），支持流式读取、内容长度校验、压缩/解压（zlib）以及 MIME 类型解析。  \n- **BadContentDispositionHeader /", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:48:06.542842"}