{"summary": "The provided code defines a module for handling HTTP responses in an aiohttp library. \nWe need to summarize the functionality of the code snippet. The snippet is from aiohttp/web_response.py. It includes imports, definitions, constants, __all__, and a method _do_start_compression. The code defines ContentCoding, StreamResponse, Response, json_response. It defines REASON_PHRASES mapping HTTP status codes to phrases. It defines CONTENT_CODINGS mapping coding values to ContentCoding. It defines __slots__ for some attributes. Then defines async def _do_start_compression(self, coding: ContentCoding) -> None: It checks if response is chunked or body is a Payload; if so, calls super()._do_start_compression(coding). If coding != identity, it creates a ZLibCompressor with encoding, max_sync_chunk_size, executor. It asserts body not None. If executor size is None and body length > 1MB, warns about blocking event loop. Then compresses body: self._compressed_body = await compressor.compress(self._body) + compressor.flush(). Then sets headers: Content-Encoding and Content-Length accordingly.\n\nThus the business logic: compress response body if not chunked and not a Payload, using zlib compression, possibly async via executor. Input: coding (ContentCoding) and response body. Output: compressed body stored, headers updated.\n\nWe need to summarize in Chinese, focusing on business logic, inputs, outputs. No \"This code does...\" etc. Just start with summary content.\n\nLet's produce a concise summary.assistantfinal实现 HTTP 响应的压缩处理。  \n- 输入：`coding`（ContentCoding 枚举），以及响应实例内部的 `_body`（原始字节串或 Payload）和压缩相关配置 `_zlib_executor_size`、`_zlib_executor`。  \n- 业务逻辑：  \n  1. 若响应采用分块传输或 `_body` 已是 `Payload`，直接委托父类的 `_do_start_compression`。  \n  2. 否则在非 `identity` 编码下创建 `ZLibCompressor`，根据 `coding` 设置压缩算法（如 gzip、deflate），并根据 `zlib_executor_size` 决定是否使用线程池异步压缩。  \n  3. 当未配置线程池且待压缩体积超过 1 MiB 时发出警告，提示", "prompt_id": "28ad819ea97a795ed2ae85e64d974c5c", "created_at": "2026-02-04T20:57:58.234474"}